{"data":{"allAnantCassandralinks":{"edges":[{"node":{"title":"How to Monitor Cassandra","alternative_id":242,"content":"<p><em>This post is part 1 of a 3-part series about monitoring Apache Cassandra performance. <a href=\"https://www.datadoghq.com/blog/how-to-collect-cassandra-metrics/\">Part 2</a> is about collecting metrics from Cassandra, and <a href=\"https://www.datadoghq.com/blog/monitoring-cassandra-with-datadog/\">Part 3</a> details how to monitor Cassandra with Datadog.</em></p><h2 id=\"what-is-cassandra\">What is Cassandra?</h2><p><a href=\"https://cassandra.apache.org/\">Apache Cassandra</a> is a distributed database system known for its scalability and fault-tolerance. Cassandra originated at Facebook as a project based on Amazon’s Dynamo and Google’s BigTable, and has since matured into a widely adopted open-source system with very large installations at companies such as Apple and Netflix. Some of Cassandra’s key attributes:</p><ul><li>Highly available (a Cassandra cluster is decentralized, with no single point of failure)</li><li>Scales nearly linearly (doubling the size of a cluster doubles your throughput)</li><li>Excels at writes at volume</li><li>Naturally accommodates data in sequence (e.g., time-series data)</li></ul><h2 id=\"key-apache-cassandra-performance-metrics\">Key Apache Cassandra performance metrics</h2><div class=\"shortcode-wrapper shortcode-img expand\"><figure class=\"\"><a href=\"https://datadog-prod.imgix.net/img/blog/how-to-monitor-cassandra-performance-metrics/cass-dash.png?fit=max\" class=\"pop\"><img class=\"lazyload\" srcset=\"https://datadog-prod.imgix.net/img/blog/how-to-monitor-cassandra-performance-metrics/cass-dash.png?auto=format&amp;fit=max&amp;w=847\" alt=\"apache cassandra performance\" src=\"https://www.datadoghq.com/blog/how-to-monitor-cassandra-performance-metrics/src\" /></a></figure></div><p>By monitoring Apache Cassandra performance you can identify slowdowns, hiccups, or pressing resource limitations—and take swift action to correct them. Some of the key areas where you will want to capture and analyze metrics are:</p><ul><li>Throughput, especially <a href=\"#throughput\">read and write requests</a></li><li>Latency, especially <a href=\"#latency\">read and write latency</a></li><li>Disk usage, especially <a href=\"#disk-usage\">disk space on each node</a></li><li>Garbage collection <a href=\"#garbage-collection\">frequency and duration</a></li><li>Errors and overruns, especially <a href=\"#metric-to-alert-on-unavailable-exceptions\">unavailable exceptions</a> which indicate failed requests due to unavailability of nodes in the cluster</li></ul><p>This article references metric terminology introduced in <a href=\"https://www.datadoghq.com/blog/monitoring-101-collecting-data/\">our Monitoring 101 series</a>, which provides a framework for metric collection and alerting. Apache Cassandra performance metrics are accessible using a variety of tools, including the Cassandra utility nodetool, the JConsole application, and JMX- or Metrics-compliant monitoring tools. For details on metrics collection using any of these tools, see <a href=\"https://www.datadoghq.com/blog/how-to-collect-cassandra-metrics/\">Part 2</a> of this series.</p><h3>Throughput</h3><table><thead></thead><tbody><tr class=\"odd\"><td>Reads</td><td>Read requests per second</td><td>Work: Throughput</td><td>JConsole, JMX/Metrics reporters</td></tr><tr class=\"even\"><td>Writes</td><td>Write requests per second</td><td>Work: Throughput</td><td>JConsole, JMX/Metrics reporters</td></tr></tbody></table><p>Monitoring the requests—both reads and writes—that Cassandra is receiving at any given time gives you a high-level view of your cluster’s activity levels. Understanding how—and how much—your cluster is being used will help you to optimize Cassandra’s performance. For instance, which compaction strategy you choose (see <a href=\"#disk-usage\">disk usage section</a> below) will likely depend on whether your workload tends to be read-heavy or write-heavy.</p><p>Cassandra’s standard metrics include <a href=\"https://en.wikipedia.org/wiki/Moving_average#Exponential_moving_average\">exponentially weighted moving averages</a> for request calls over 15-minute, five-minute, and one-minute intervals. The one-minute rates for <strong>read and write throughput</strong> are especially useful for near-real-time visibility. These latency metrics are available from Cassandra aggregated by request type (e.g., read or write), or per column family (the Cassandra analogue of a database table).</p><p>Monitoring the rate of queries at any given time provides the highest-level view of how your clients are interacting with Cassandra. And since Cassandra excels at handling high volumes of writes, you will often want to keep a close eye on the read rate to look out for potential problems or significant changes in your clients’ query patterns. Consider alerting on sustained spikes (over historical baselines) or sudden, unexpected drops (on a percentage basis over a short timeframe) in throughput.</p><div class=\"shortcode-wrapper shortcode-img expand\"><figure class=\"\"><a href=\"https://datadog-prod.imgix.net/img/blog/how-to-monitor-cassandra-performance-metrics/reads-3.png?fit=max\" class=\"pop\"><img class=\"lazyload\" srcset=\"https://datadog-prod.imgix.net/img/blog/how-to-monitor-cassandra-performance-metrics/reads-3.png?auto=format&amp;fit=max&amp;w=847\" alt=\"apache cassandra performance\" src=\"https://www.datadoghq.com/blog/how-to-monitor-cassandra-performance-metrics/src\" /></a></figure></div><h4 id=\"metric-to-alert-on-write-throughput\">Metric to alert on: Write throughput</h4><p>Cassandra should be able to gracefully handle large numbers of writes. Nevertheless, it is well worth monitoring the volume of write requests coming into Cassandra so that you can track your cluster’s overall activity levels and watch for any anomalous spikes or dips that warrant further investigation.</p><div class=\"shortcode-wrapper shortcode-img expand\"><figure class=\"\"><a href=\"https://datadog-prod.imgix.net/img/blog/how-to-monitor-cassandra-performance-metrics/writes-3.png?fit=max\" class=\"pop\"><img class=\"lazyload\" srcset=\"https://datadog-prod.imgix.net/img/blog/how-to-monitor-cassandra-performance-metrics/writes-3.png?auto=format&amp;fit=max&amp;w=847\" alt=\"apache cassandra performance\" src=\"https://www.datadoghq.com/blog/how-to-monitor-cassandra-performance-metrics/src\" /></a></figure></div><h3 id=\"latency\">Latency</h3><table><thead></thead><tbody><tr class=\"odd\"><td>Write latency</td><td>Write response time, in microseconds</td><td>Work: Performance</td><td>nodetool, JConsole, JMX/Metrics reporters</td></tr><tr class=\"even\"><td>Read latency</td><td>Read response time, in microseconds</td><td>Work: Performance</td><td>nodetool, JConsole, JMX/Metrics reporters</td></tr><tr class=\"odd\"><td>Key cache hit rate</td><td>Fraction of read requests for which the key’s location on disk was found in the cache</td><td>Other</td><td>nodetool, JConsole, JMX/Metrics reporters</td></tr></tbody></table><p>Like any database system, Cassandra has its limitations—for instance, there are no joins in Cassandra, and querying by anything other than the row key requires multiple steps. The upside is that Cassandra makes tradeoffs like these to ensure fast writes across a large, distributed data store.</p><p>So whatever your Cassandra use case, chances are you care a great deal about write performance. And for many applications, such as supporting user queries, read performance is extremely important as well. Monitoring latency gives you a critical view of overall Cassandra performance and can indicate developing problems or a shifting in usage patterns that may require adjustments to your Cassandra cluster.</p><p>Cassandra slices latency statistics into a number of different metrics, but perhaps the simplest and highest-value metrics to monitor are the current read and write latency. The Cassandra metric <strong>write latency</strong> measures the number of microseconds required to fulfill a write request, whereas <strong>read latency</strong> measures the same for read requests. Understanding what to look for in these metrics requires a bit of background on how Cassandra handles requests.</p><h4 id=\"how-cassandra-distributes-reads-and-writes\">How Cassandra distributes reads and writes</h4><p>Several factors impact Cassandra’s latency, from the speed of your disks to the networks linking the nodes and data centers of your cluster. Tuning two major Cassandra parameters, which control the flow of data into and out of a cluster, can also have an effect.</p><p>The <strong>replication factor</strong> dictates how many nodes in a data center contain a replica of each row of data. <strong>Consistency level</strong> defines how many of the replica nodes must respond to a read or write request before Cassandra considers that action a success. For instance:</p><ul><li>A consistency level of <code>ONE</code> requires a response from only one replica node;</li><li><code>QUORUM</code> requires a response from a quorum of replicas, with the quorum determined by the formula (replication_factor / 2) + 1, rounded down;</li><li><code>ALL</code> requires that all replica nodes respond.</li></ul><p>Together, these two factors control how many independent read or write operations must take place before an individual request is fulfilled. For instance, consider the 12-node data center in the diagram below, with a replication factor of three. Each write request will eventually propagate to three replica nodes, but the number of nodes that must perform a write before the request can be acknowledged as successful depends on the consistency level: one node (for consistency level <code>ONE</code>), two nodes (<code>QUORUM</code>), or three nodes (<code>ALL</code>). Similarly, a read request must retrieve responses from only the nearest node (<code>ONE</code>), from two replicas (<code>QUORUM</code>), or from all three replica nodes (<code>ALL</code>). If replica nodes return conflicting data in response to a read request, the most recently timestamped version of the row will be sent to the client.</p><div class=\"shortcode-wrapper shortcode-img expand\"><figure class=\"\"><a href=\"https://datadog-prod.imgix.net/img/blog/how-to-monitor-cassandra-performance-metrics/diagram.png?fit=max\" class=\"pop\"><img class=\"lazyload\" srcset=\"https://datadog-prod.imgix.net/img/blog/how-to-monitor-cassandra-performance-metrics/diagram.png?auto=format&amp;fit=max&amp;w=847\" alt=\"\" src=\"https://www.datadoghq.com/blog/how-to-monitor-cassandra-performance-metrics/src\" /></a></figure></div><p>These parameters provide you with control over your data store’s consistency, availability, and latency. For instance, a consistency level of <code>ONE</code> provides the lowest latency, but increases the probability of stale data being read, since recent updates to a row may not have propagated to every node by the time a read request arrives for that row. On the other hand, a consistency level of <code>ALL</code> provides the highest levels of data consistency but means that a read or write request will fail if any of the replicas are unavailable.</p><p>The replication factor is defined when you create a “keyspace” to contain your column families. (A keyspace is akin to a database in a relational context: the keyspace is a collection of column families, just as the database is a collection of tables.) For instance, to create a keyspace called “test,” with each row of each column family replicated three times across the data center, you would run the following command in the CQL (Cassandra Query Language) shell, which is available from Cassandra’s home directory:</p><pre>$ bin/cqlsh\ncqlsh&gt; CREATE KEYSPACE test WITH REPLICATION = {\n       'class' : 'SimpleStrategy',\n       'replication_factor' : 3\n       };\n</pre><p>Consistency levels can be set via CQLsh as well:</p><pre>cqlsh&gt; CONSISTENCY;\nCurrent consistency level is ONE.\ncqlsh&gt; CONSISTENCY QUORUM;\nConsistency level set to QUORUM.   \n</pre><h4 id=\"key-caching\">Key caching</h4><p>Cassandra also features adjustable caches to minimize disk usage and therefore read latency. By default, Cassandra uses a key cache to store the location of row keys in memory so that rows can be accessed without having to first seek them on disk. The <strong>key cache hit rate</strong> provides visibility into the effectiveness of your key cache. If the key cache hit rate is consistently high (above 0.85, or 85 percent), then the vast majority of read requests are being expedited through caching. If the key cache is not consistently serving up row locations for your read requests, consider increasing the size of the cache, which can be a low-overhead tactic for improving read latency.</p><p>The size of the key cache can be checked or set with the <code>key_cache_size_in_mb</code>: setting in the <code>conf/cassandra.yaml</code> file. You can also set the key cache capacity from the command line, using the nodetool utility that ships with Cassandra. For instance, to set the key cache capacity on localhost to 100 megabytes:</p><pre>$ bin/nodetool --host 127.0.0.1 setcachecapacity -- 100 0 \n</pre><p>The same command can be used to set the size of the row cache (set to zero in the example above), which stores actual rows in memory rather than simply caching the location of those rows. The row cache can provide significant speedups, but it can also be very memory-intensive and must be used carefully. As a result, Cassandra disables row caching by default.</p><h4 id=\"metric-to-alert-on-write-latency\">Metric to alert on: Write latency</h4><p>Cassandra writes are usually much faster than reads, since a write need only be recorded in memory and appended to a durable commit log before it is acknowledged as a success. The specific latency levels that you deem acceptable will depend on your use case. Chronically slow writes point to systemic issues; you may need to upgrade your disks to faster SSDs or check your consistency settings. (The consistency setting <code>EACH_QUORUM</code>, for example, requires communication between data centers, which may be geographically distant.) But a sudden change, as seen midway through the time-series graph below, usually indicates potentially problematic developments such as network issues or changes in usage patterns (e.g., a significant increase in the size of database inserts).</p><div class=\"shortcode-wrapper shortcode-img expand\"><figure class=\"\"><a href=\"https://datadog-prod.imgix.net/img/blog/how-to-monitor-cassandra-performance-metrics/write-latency.png?fit=max\" class=\"pop\"><img class=\"lazyload\" srcset=\"https://datadog-prod.imgix.net/img/blog/how-to-monitor-cassandra-performance-metrics/write-latency.png?auto=format&amp;fit=max&amp;w=847\" alt=\"\" src=\"https://www.datadoghq.com/blog/how-to-monitor-cassandra-performance-metrics/src\" /></a></figure></div><p>Cassandra’s read operations are usually much slower than writes, because reads involve more I/O. If a row is frequently updated, it may be spread across several SSTables, increasing the latency of the read. Nevertheless, read latency can be a very important metric to watch, especially if Cassandra queries are serving up data into a user-facing application. Slow reads can point to problems with your hardware or your data model, or else a parameter in need of tuning, such as compaction strategy. In particular, if read latency starts to climb in a cluster running level-tiered compaction, it may be a sign that nodes are struggling to handle the volume of writes and the associated compaction operations.</p><div class=\"shortcode-wrapper shortcode-img expand\"><figure class=\"\"><a href=\"https://datadog-prod.imgix.net/img/blog/how-to-monitor-cassandra-performance-metrics/read-latency.png?fit=max\" class=\"pop\"><img class=\"lazyload\" srcset=\"https://datadog-prod.imgix.net/img/blog/how-to-monitor-cassandra-performance-metrics/read-latency.png?auto=format&amp;fit=max&amp;w=847\" alt=\"\" src=\"https://www.datadoghq.com/blog/how-to-monitor-cassandra-performance-metrics/src\" /></a></figure></div><h3 id=\"disk-usage\">Disk usage</h3><table><thead></thead><tbody><tr class=\"odd\"><td>Load</td><td>Disk space used on a node, in bytes</td><td>Resource: Utilization</td><td>nodetool, JConsole, JMX/Metrics reporters</td></tr><tr class=\"even\"><td>Total disk space used</td><td>Disk space used by a column family, in bytes</td><td>Resource: Utilization</td><td>nodetool, JConsole, JMX/Metrics reporters</td></tr><tr class=\"odd\"><td>Completed compaction tasks</td><td>Total compaction tasks completed</td><td>Resource: Other</td><td>JConsole, JMX/Metrics reporters</td></tr><tr class=\"even\"><td>Pending compaction tasks</td><td>Total compaction tasks in queue</td><td>Resource: Saturation</td><td>nodetool, JConsole, JMX/Metrics reporters</td></tr></tbody></table><p>You will almost certainly want to keep an eye on how much disk Cassandra is using on each node of your cluster so that you can add more nodes before you run out of storage.</p><p>Cassandra exposes <a href=\"https://wiki.apache.org/cassandra/Metrics\">several different disk metrics</a>, but the simplest ones to monitor are load or total disk space used. The metric “<strong>load</strong>” has nothing to do with processing load or requests in queue; rather it is a node-level metric that indicates the amount of disk, in bytes, used by that node. <strong>Total disk space used</strong> provides the total number of bytes used by a given column family (the Cassandra analogue of a database table). If you aggregate either metric across your entire cluster, you should arrive at the overall size of your Cassandra data store.</p><p>How much free disk space you need to maintain depends on which compaction strategy your Cassandra column families use. When Cassandra writes data to disk, it does so by creating an immutable file called an SSTable. Updates to the data are managed by creating new, timestamped SSTables; deletes are accomplished by marking data to be removed with “tombstones.” To optimize read performance and disk usage, Cassandra periodically runs compaction to consolidate SSTables and remove outdated or tombstoned data.</p><p>During compaction, Cassandra creates and completes new SSTables before deleting the old ones; this means that the old and new SSTables temporarily coexist, increasing short-term disk usage on the cluster. The size of that increase (and therefore the disk space needed) varies greatly by compaction strategy:</p><ul><li>The default compaction strategy, <strong>size-tiered compaction</strong>, merges SSTables of similar size. Size-tiered compaction requires the most available disk space (50 percent or more of total disk capacity) because, in the most extreme case, it can temporarily double the amount of data stored in Cassandra. This strategy was designed for write-heavy workloads.</li><li><strong>Level-tiered compaction</strong> groups SSTables into progressively larger levels, within which each SSTable is non-overlapping. This strategy is more I/O-intensive than size-tiered compaction, but it ensures that most of the time a read can be satisfied by a single SSTable, rather than reading from different versions of a row spread across many SSTables. Aside from providing performance benefits for read-intensive uses, level-tiered compaction also requires much less disk overhead (roughly 10 percent of disk) for temporary use during compaction.</li><li><strong>Date-tiered compaction</strong>, a newer option that is optimized for time-series data, groups and compacts SSTables based on the age of the data points they contain. Date-tiered compaction has configurable compaction windows, so the disk space needed for compaction can be controlled by adjusting options such as <code>maxSSTableAgeDays</code>, which tells Cassandra to stop compacting SSTables once they reach a certain age.</li></ul><p>Compaction activity can be tracked via metrics for <strong>completed compaction tasks</strong> and <strong>pending compaction tasks</strong>. Completed compactions will naturally trend upward with increased write activity, but a growing queue of pending compaction tasks indicates that the Cassandra cluster is unable to keep pace with the workload, often because of I/O limitations or resource contention that may require the addition of new nodes.</p><h4 id=\"metric-to-alert-on-load\">Metric to alert on: Load</h4><p>Monitoring the disk used by each node can alert you to an unbalanced cluster or looming resource constraints. Depending on how your Cassandra cluster is used and the compaction strategy that you choose, you can monitor disk utilization to determine when you should add more nodes to your cluster to ensure that Cassandra always has enough room to run compactions.</p><div class=\"shortcode-wrapper shortcode-img expand\"><figure class=\"\"><a href=\"https://datadog-prod.imgix.net/img/blog/how-to-monitor-cassandra-performance-metrics/disk-usage.png?fit=max\" class=\"pop\"><img class=\"lazyload\" srcset=\"https://datadog-prod.imgix.net/img/blog/how-to-monitor-cassandra-performance-metrics/disk-usage.png?auto=format&amp;fit=max&amp;w=847\" alt=\"\" src=\"https://www.datadoghq.com/blog/how-to-monitor-cassandra-performance-metrics/src\" /></a></figure></div><h3 id=\"garbage-collection\">Garbage collection</h3><table><thead></thead><tbody><tr class=\"odd\"><td>ParNew count</td><td>Number of young-generation collections</td><td>Other</td><td>nodetool,* JConsole, JMX/Metrics reporters</td></tr><tr class=\"even\"><td>ParNew time</td><td>Elapsed time of young-generation collections, in milliseconds</td><td>Other</td><td>nodetool,* JConsole, JMX/Metrics reporters</td></tr><tr class=\"odd\"><td>ConcurrentMarkSweep count</td><td>Number of old-generation collections</td><td>Other</td><td>nodetool,* JConsole, JMX/Metrics reporters</td></tr><tr class=\"even\"><td>ConcurrentMarkSweep time</td><td>Elapsed time of old-generation collections, in milliseconds</td><td>Other</td><td>nodetool,* JConsole, JMX/Metrics reporters</td></tr></tbody></table><p>*<em>Note that nodetool reports metrics on all garbage collections, regardless of type</em></p><p>Because Cassandra is a Java-based system, it relies on Java garbage collection processes to free up memory. The more activity in your Cassandra cluster, the more often the garbage collector will run. The type of garbage collection depends on whether the young generation (new objects) or the old generation (long-surviving objects) is being collected.</p><p><strong>ParNew</strong>, or young-generation, garbage collections occur relatively often. ParNew is a stop-the-world garbage collection, meaning that all application threads pause while garbage collection is carried out, so any significant increase in ParNew latency will impact Cassandra’s performance.</p><p><strong>ConcurrentMarkSweep</strong> (CMS) collections free up unused memory in the old generation of the heap. CMS is a low-pause garbage collection, meaning that although it does temporarily stop application threads, it does so only intermittently. If CMS is taking a few seconds to complete, or is occurring with increased frequency, your cluster may not have enough memory to function efficiently.</p><h3 id=\"errors-and-overruns\">Errors and overruns</h3><table><thead></thead><tbody><tr class=\"odd\"><td>Exceptions</td><td>Requests for which Cassandra encountered an (often nonfatal) error</td><td>Work: Error</td><td>nodetool, JConsole, JMX/Metrics reporters</td></tr><tr class=\"even\"><td>Timeout exceptions</td><td>Requests not acknowledged within configurable timeout window</td><td>Work: Error</td><td>JConsole, JMX/Metrics reporters</td></tr><tr class=\"odd\"><td>Unavailable exceptions</td><td>Requests for which the required number of nodes was unavailable</td><td>Work: Error</td><td>JConsole, JMX/Metrics reporters</td></tr><tr class=\"even\"><td>Pending tasks</td><td>Tasks in a queue awaiting a thread for processing</td><td>Resource: Saturation</td><td>nodetool, JConsole, JMX/Metrics reporters</td></tr><tr class=\"odd\"><td>Currently blocked tasks</td><td>Tasks that cannot yet be queued for processing</td><td>Resource: Saturation</td><td>nodetool, JConsole, JMX/Metrics reporters</td></tr></tbody></table><p>If your cluster can no longer handle the flow of incoming requests for whatever reason, you need to know right away. One window into potential problems is Cassandra’s count of <strong>exceptions</strong> thrown. In general, you want this number to be very small, although not all exceptions are created equal.</p><p>For instance, Cassandra’s <strong>timeout exception</strong> reflects the incomplete (but not failed) handling of a request. Timeouts occur when the coordinator node sends a request to a replica and does not receive a response within the configurable timeout window. Timeouts are not necessarily fatal—the coordinator will store the update and attempt to apply it later—but they can indicate network issues or even disks nearing capacity. The settings <code>read_request_timeout_in_ms</code> (defaults to 5,000 milliseconds), <code>write_request_timeout_in_ms</code> (defaults to 2,000 ms), and other timeout windows <a href=\"https://docs.datastax.com/en/cassandra/2.1/cassandra/configuration/configCassandra_yaml_r.html\">can be set</a> in the <code>cassandra.yaml</code> configuration file.</p><p>A more worrisome exception type is the <strong>unavailable exception</strong>, which indicates that Cassandra was unable to meet the consistency requirements for a given request, usually because one or more nodes were reported as down when the request arrived. For instance, in a cluster with replication factor of three and a consistency level of ALL, a read or write request will need to reach all three replica nodes in the cluster to perform a successful read or write.</p><p>Another way to detect signs of incipient problems is to monitor the status of Cassandra’s tasks as it processes requests. Each type of task in Cassandra (e.g., ReadStage tasks) has a queue for incoming tasks and is allotted a certain number of threads for executing those tasks. If all threads are in use, tasks will accumulate in the queue awaiting an available thread. The number of tasks in a queue at any given moment is described by the metric <strong>pending tasks</strong>. Once the queue of pending tasks fills up, Cassandra will register additional incoming tasks as <strong>currently blocked</strong>, although those tasks may eventually be accepted and executed.</p><p>An unavailable exception is the only exception that will cause a write to fail, so any occurrences are serious. Cassandra’s inability to meet consistency requirements can mean that several nodes are down or otherwise unreachable, or that stringent consistency settings are limiting the availability of your cluster.</p><div class=\"shortcode-wrapper shortcode-img expand\"><figure class=\"\"><a href=\"https://datadog-prod.imgix.net/img/blog/how-to-monitor-cassandra-performance-metrics/unavailables.png?fit=max\" class=\"pop\"><img class=\"lazyload\" srcset=\"https://datadog-prod.imgix.net/img/blog/how-to-monitor-cassandra-performance-metrics/unavailables.png?auto=format&amp;fit=max&amp;w=847\" alt=\"\" src=\"https://www.datadoghq.com/blog/how-to-monitor-cassandra-performance-metrics/src\" /></a></figure></div><h2>Conclusion</h2><p>In this post we’ve explored several of the metrics you should monitor to keep tabs on your Cassandra cluster. If you are just getting started with Cassandra, monitoring the metrics in the list below will provide visibility into your data store’s health, performance, and resource usage, and may help identify areas where tuning could provide significant benefits:</p><ul><li><a href=\"#throughput\">Read and write throughput</a></li><li><a href=\"#latency\">Read and write latency</a></li><li><a href=\"#disk-usage\">Disk usage per node (load)</a></li><li><a href=\"#garbage-collection\">Garbage collection frequency and duration</a></li><li><a href=\"#metric-to-alert-on-unavailable-exceptions\">Unavailable exceptions</a></li></ul><p>Eventually you will recognize additional, more specialized metrics that are particularly relevant to your own Cassandra cluster and its users. For instance, if the vast majority of your data lives in a single column family, you may find column family–level metrics especially valuable, whereas more aggregated metrics may be more informative if your data is spread across a large number of column families.</p><p><a href=\"https://www.datadoghq.com/blog/how-to-collect-cassandra-metrics/\">Read on</a> for a comprehensive guide to collecting any of the metrics described in this article, or any other metric exposed by Cassandra.</p><h2 id=\"acknowledgments\">Acknowledgments</h2><p>Many thanks to Matt Stump and Adam Hutson for suggesting additions and improvements to this article.</p><hr /><p><em>Source Markdown for this post is available <a href=\"https://github.com/DataDog/the-monitor/blob/master/cassandra/how_to_monitor_cassandra_performance_metrics.md\">on GitHub</a>. Questions, corrections, additions, etc.? Please <a href=\"https://github.com/DataDog/the-monitor/issues\">let us know</a>.</em></p>"}}]}},"pageContext":{"alternative_id":242}}