{"data":{"allAnantCassandralinks":{"edges":[{"node":{"title":"phact/dse-cluster-migration","alternative_id":12719,"content":"<article class=\"markdown-body entry-content\" itemprop=\"text\">\n<p>NOTE: If you are looking to perform a migration across two clusters, make sure\nyou deploy two clusters!</p>\n<p>This is a Demo for Migrating DSE and cassandra clusters (or even tables within the same cluster) using DSE Analytics / Spark.</p>\n<h3><a id=\"user-content-motivation\" class=\"anchor\" aria-hidden=\"true\" href=\"#motivation\"></a>Motivation</h3>\n<p>Moving data across clusters for one time migrations or bulk migrations are relatively common. DSE Analytics Makes this process almost trivial for users that are well versed in Spark. In a <a href=\"http://www.sestevez.com/cluster-migration-keeping-simple-things-simple/\" rel=\"nofollow\">previous blog post</a> I attempted to make this process simpler for users with minimal spark experience. This asset aims to make this process easy even for users that with no spark experience at all.</p>\n<h3><a id=\"user-content-what-is-included\" class=\"anchor\" aria-hidden=\"true\" href=\"#what-is-included\"></a>What is included?</h3>\n<p>This field asset (demo) includes the following:</p>\n<ul><li>dse-cluster-migration Spark Job</li>\n<li>Performs migration using massively parallel Spark compute</li>\n<li>Code is visible in the Che web IDE which ships with this asset</li>\n<li>MigUI (Migration UI) web appication</li>\n<li>React Redux frontend</li>\n<li>Dropwizard backend</li>\n<li>Uses webhdfs to programatically upload the spark job jar to DSEFS</li>\n<li>Uses the DSE only CQL Spark interface (currently an internal undocumented API) to submit the spark job to DSE</li>\n</ul><h3><a id=\"user-content-business-take-aways\" class=\"anchor\" aria-hidden=\"true\" href=\"#business-take-aways\"></a>Business Take Aways</h3>\n<p>DSE is the best distribution of Apache Cassandra and the easiest to use. By taking advantage of the migration capabilities in DSE analytics, projects can get off the ground faster and complex business requirements have a shorter time to Value.</p>\n<h3><a id=\"user-content-technical-take-aways\" class=\"anchor\" aria-hidden=\"true\" href=\"#technical-take-aways\"></a>Technical Take Aways</h3>\n<p>In some DSE to DSE or c* to DSE scenarios, there are a few cases in which a cluster migration is easier to perform than an upgrade. When the source cluster needs to remain place (i.e. data migrations accross environments, DEV &lt;-&gt; SIT &lt;-&gt; UAT &lt;-&gt; PROD) DSE Analytics can be the right solution.</p>\n<p>Look at this asset if you are interested in:\nUsing Spark to migrate data from one cluster to another\nUsing Spark to move a table to another table in the same cluster\nProgramatically writing to DSEFS from Java\nProgramatically using CQL to kick off DSE Analytics jobs (NOTE this is unsupported and undocumented at this time)</p>\n</article>"}}]}},"pageContext":{"alternative_id":12719}}