{"data":{"allAnantCassandralinks":{"edges":[{"node":{"title":"Cassandra schema migrations made easy with Apache Spark","alternative_id":10844,"content":"By far the most common question I get asked when talking about Cassandra is once you've denormalised based on your queries what happens if you were wrong or a new requirement comes in that requires a new type of query.\n<p>First I always check that it is a real requirement to be able to have this new functionality on old data. If that's not the case, and often it isn't, then you can just start double/triple writing into the new table.\n</p><p>However if you truly need to have the new functionality on old data then Spark can come to the rescue. The first step is to still double write. We can then backfill using Spark. The awesome thing is that nearly all writes in Cassandra are idempotent, so when we backfill we don't need to worry about inserting data that was already inserted via the new write process.\n</p><p>Let's see an example. Suppose you were storing customer events so you know what they are up to. At first you want to query by customer/time so you end up with following table:\n</p><p>Then the requirement comes in to be able to look for events by staff member. My reaction a couple of years ago would have been something like this:\n</p><div class=\"separator\"><a href=\"http://4.bp.blogspot.com/-ocpWDOp6ZHM/VOXt4fiOlII/AAAAAAAAAYQ/KBdlMbLjO4I/s1600/oh-noes-everybody-panic.gif\"><img border=\"0\" src=\"http://4.bp.blogspot.com/-ocpWDOp6ZHM/VOXt4fiOlII/AAAAAAAAAYQ/KBdlMbLjO4I/s1600/oh-noes-everybody-panic.gif\" alt=\"image\" /></a>\n</div><br />However if you have Spark workers on each of your Cassandra nodes then this is not an issue.<p>Assuming you want to a new table keyed by staff_id and have modified your application to double write you do the back fill with Spark. Here's the new table:\n</p><p>Then open up a Spark-shell (or submit a job) with the Spark-Cassandra connector on the classpath and all you'll need is something like this:\n</p><p>How can a few lines do so much! If you're in a shell obviously you don't even need to create a SparkContext. What will happen here is the Spark workers will process the partitions on a Cassandra node that owns the data for the customer table (original table) and insert it back into Cassandra locally. Cassandra will then handle the replication to the correct nodes for the staff table.\n</p><p>This is the least network traffic you could hope to achieve. Any solution that you write your self with Java/Python/Shell will involve pulling the data back to your application and pushing it to a new node, which will then need to replicate it for the new table.\n</p><p>You won't want to do this at a peak time as this will HAMMER you Cassandra cluster as Spark is going to do this quickly. If you have a small DC for just running the Spark jobs and let it asynchronously replicate to your operational DC this is less of a concern.\n  </p>"}}]}},"pageContext":{"alternative_id":10844}}