{"data":{"allAnantCassandralinks":{"edges":[{"node":{"title":"Update released for Instaclustr sstable analysis tools for Apache Cassandra - Instaclustr","alternative_id":12164,"content":"<header id=\"page-masthead\"><div id=\"page-content\"><div class=\"container\"><div class=\"row\"><div class=\"col-md-6 col-md-offset-0 col-sm-8 col-sm-offset-2\"><div class=\"primary first-p-bold\"><p>Instaclustr is pleased to announce the latest update for it’s open-sourced sstable analysis tools for Apache Cassandra.</p><p>These tools, first released in February 2017, help operators to gain an accurate picture of the on-disk data stored by Cassandra which can be invaluable in diagnose and resolving operational issues.</p><p>A full run-through of the existing functionality of the tools can be found in <a href=\"https://www.instaclustr.com/instaclustr-open-sources-cassandra-sstable-analysis-tools/\">this blog post</a>.</p><p>This latest release, available in source from <a href=\"https://github.com/instaclustr/cassandra-sstable-tools\">Instaclustr Github</a> or in compiled download from our <a href=\"https://www.instaclustr.com/support/documentation/tools/ic-tools-for-cassandra-sstables/\">support page</a>, </p><ul><li>Improved support of TWCS – sorting by maximum timestamp in the sstable listing</li> <li>For Apache Cassandra 3.x, ic-cfstats reports about rows including: <ul><li>Total number of rows</li> <li>Total number of row deletions</li> <li>A row histogram giving number of rows per partition</li> <li>Largest partitions/widest partitions report includes number of rows and how many row deletions</li> <li>Added a Most Deleted Rows section reporting partitions with most row deletions</li> <li>Tombstone Leaders and SSTable Leaders reports number of rows</li> </ul></li> <li>ic-cfstats and ic-pstats includes histogram of partition sizes and sstables/partition in the summary</li> </ul><p>Instaclustr uses these tools to help support customers on our <a href=\"https://www.instaclustr.com/solutions/managed-apache-cassandra/\">Apache Cassandra Managed Service</a> and provides support for the use of the tools for our <a href=\"https://www.instaclustr.com/services/cassandra-support/\">Apache Cassandra Enterprise Support</a> customers.</p></div></div></div></div></div></header>"}}]}},"pageContext":{"alternative_id":12164}}