{"data":{"allAnantCassandralinks":{"edges":[{"node":{"title":"Common Problems with Cassandra Tombstones - OpenCredo","alternative_id":13121,"content":"Common Problems with Cassandra Tombstones - OpenCredo&#13;\n&#13;\n\t\t<header class=\"bg-white-90 text-blue fixed w-full z-9999 transition-slow\">&#13;\n</header><section class=\"breadcrumb\"><section><div class=\"wrapper justify-start sm:flex-row pt-0 sm:pt-90 pb-60 max-w-full-minus-60 lg:max-w-895 mb-120\"><div class=\"w-full sm:w-2/3 pr-0 sm:pr-20\"><p class=\"font-title mb-10 uppercase\">&#13;\n\t\tSeptember 27, 2016&#13;\n\t | <a href=\"https://opencredo.com/blogs/category/cassandra/\" class=\"text-blue\">Cassandra</a>, <a href=\"https://opencredo.com/blogs/category/data-engineering/\" class=\"text-blue\">Data Engineering</a></p><p>If there is one thing to understand about Cassandra, it is the fact that it is optimised for writes. In Cassandra everything is a write including logical deletion of data which results in tombstones – special deletion records. We have noticed that lack of understanding of tombstones is often the root cause of production issues our clients experience with Cassandra. We have decided to share a compilation of the most common problems with Cassandra tombstones and some practical advice on solving them.</p></div><div class=\"w-full sm:w-1/3 text-center first-on-sm mb-30\"><p class=\"font-title font-bold mt-30\">WRITTEN BY</p><img src=\"https://15rf562os5r61q4tvf2630fw-wpengine.netdna-ssl.com/wp-content/uploads/2018/11/Alla-Babkina-_-No-Job-Title.jpg\" alt=\"Alla Babkina\" class=\"circle mb-7.5 h-64 sm:h-auto w-64 sm:w-auto\" /><p class=\"font-title text-orange uppercase font-bold mb-0\"><a href=\"https://opencredo.com/authors/alla-babkina/\" title=\"Posts by Alla Babkina\">Alla Babkina</a></p></div></div></section><section class=\"bg-light-grey\"><div class=\"wrapper max-w-full-minus-60 lg:max-w-895 mb-30\"><div class=\"max-w-full\"><img src=\"https://15rf562os5r61q4tvf2630fw-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/banner-services-895x196.jpg\" alt=\"Common Problems with Cassandra Tombstones\" class=\"-mt-120 mb-30 md:mb-60\" /><p>Tombstones are a mechanism which allows Cassandra to write fast but it has an operational price to pay. First of all, tombstones are themselves records. They take up space and can substantially increase the amount of storage you require. Secondly, querying tables with a large number of tombstones causes performance problems explained below.</p><h2>Large Number of Tombstones Causes Latency and Heap Pressure</h2><p>The <code>cassandra.yaml</code> comments explain in perfectly: <em>“When executing a scan, within or across a partition, we need to keep the tombstones seen in memory so we can return them to the coordinator, which will use them to make sure other replicas also know about the deleted rows. With workloads that generate a lot of tombstones, this can cause performance problems and even exhaust the server heap.”</em></p><p>For illustration purposes consider the following table with a composite partition key of 2 columns, 2 clustering columns and 2 text columns:</p><p>A row with all values set in JSON representation is as follows:</p><p>If you delete <code>real_col_1</code>, the row will have a server timestamp, client timestamp and <code>“d”</code> flag which marks the column deleted:</p><p>If you delete the entire row, the tombstone will be as follows:</p><p>This gives you a rough estimate of how much extra data Cassandra loads into memory when reading tombstones along the way on executing a query. For a simple single partition query consider roughly a 1.5ms penalty for every 1000 tombstones encountered (performance may vary).</p><h2>“How do we get tombstones without deleting anything?”</h2><p>One common misconception is that tombstones only appear when the client issues <code>DELETE</code> statements to Cassandra. Some developers assume that it is safe to choose a way of operations which relies on Cassandra being completely tombstone free. In reality there are other many other things causing tombstones apart from issuing <code>DELETE</code> statements. Inserting <code>null</code> values, inserting collections and expiring data using <a href=\"http://docs.datastax.com/en/cql/3.3/cql/cql_using/useExpire.html\" target=\"_blank\" rel=\"noopener\">TTL</a> are common sources of tombstones. There is also a type of tombstones currently invisible to Cassandra tools and metrics – column range tombstones, so you may actually have a tombstone problem without realising you have tombstones at all.</p><h3>Inserting null values</h3><p>It is worth repeating that Cassandra is optimised for fast writes: it will not read data to check a condition before writing – that would slow writes down (<a href=\"http://docs.datastax.com/en/cql/3.3/cql/cql_using/useInsertLWT.html\" target=\"_blank\" rel=\"noopener\">Lightweight Transactions</a> are one exception – they will read before writing at a cost of a 4x latency). As a result, even if the first value you ever write to a column is <code>null</code>, Cassandra will not check to see if that value already exists; it will simply mark the column with a tombstone for deletion. The statement below will result in a tombstone for <code>value_2</code> even if it is the first insertion for <code>key=1</code>. The tombstone is highlighted in the JSON representation:</p><p>To avoid this, do not insert <code>null</code> values, use unset columns instead. In the previous example, we can leave <code>col_2</code> <strong>unset</strong> instead of setting it to <code>null</code> in CQL. This is allowed as long as <code>col_2</code> is not part of the primary key.</p><p>When using the Java driver, you can either omit the column name you are not setting when issuing an <code>INSERT</code> or <code>UPDATE</code> statement or use the <code>unset()</code> method (<a href=\"https://datastax.github.io/java-driver/manual/statements/prepared/\" target=\"_blank\" rel=\"noopener\">see documentation</a>) on bound statements to explicitly alter it:</p><h3>Inserting values into collection columns</h3><p>Using Cassandra collections inevitably results in tombstones even if you never delete a value. Again, this is the result of Cassandra being optimised for writes. Consider the following table with list, set and map columns:</p><p>When you insert the first row into this table with collection values set you will see three tombstones recorded in an SSTable for <code>collection_table</code>:</p><p>Cassandra optimises for writes and does not check if the list has changed (or even existed), instead, it immediately deletes its before inserting the new one. Be aware of this when choosing to use collections as column types.</p><h3>Expiring Data with TTL</h3><p>Expiring data by setting a <a href=\"http://docs.datastax.com/en/cql/3.3/cql/cql_using/useExpire.html\" target=\"_blank\" rel=\"noopener\">TTL (Time To Live)</a> is one an alternative to deleting data explicitly but technically results in the same tombstones recorded by Cassandra and requiring the same level of attention as other types of tombstones.</p><h3>The Invisible Column Range Tombstones</h3><p>Issuing an explicit delete statement for a range of rows will result in a <em>column range tombstone</em>. Consider the following table:</p><p>Even with no data present, issuing the following delete statement will result in a corresponding range tombstone.</p><p>This is a normal column range tombstone whose format tells you that a whole collection for partition key 1 and clustering column 2 has been deleted. The problem with tombstones like this is that they are not accounted for in Cassandra metrics or diagnostic tools. The will not contribute to the number of tombstones in a <a href=\"https://docs.datastax.com/en/cql/3.3/cql/cql_reference/tracing_r.html\" target=\"_blank\" rel=\"noopener\">tracing</a> summary or average numbers of tombstones in <a href=\"https://docs.datastax.com/en/cassandra/3.x/cassandra/tools/toolsTablestats.html\" target=\"_blank\" rel=\"noopener\">nodetool tablestats</a>. At the time of this writing it is a known problem and a <a href=\"https://issues.apache.org/jira/browse/CASSANDRA-11166\" target=\"_blank\" rel=\"noopener\">ticket is raised for this in Cassandra JIRA</a>. For example, selecting by <code>key 1</code> and <code>c_column 2</code> with tracing enabled will not report any tombstones encountered even though we <strong>know</strong> there is one. Note that tombstone warning / failure alerts set in <code>cassandra.yaml</code> will not detect column range tombstones either; this is also a <a href=\"https://issues.apache.org/jira/browse/CASSANDRA-8527\" target=\"_blank\" rel=\"noopener\">known issue</a>. For example, see the following tracing output:</p><div id=\"attachment_28867\" class=\"wp-caption aligncenter\"><img src=\"https://15rf562os5r61q4tvf2630fw-wpengine.netdna-ssl.com/wp-content/uploads/2016/09/Screen-Shot-2016-09-27-at-13.51.42-1200x337.png\" alt=\"Cassandra Tracing\" width=\"800\" height=\"337\" /><p class=\"wp-caption-text\">Query Tracing</p></div><p>Even though column range tombstones are not currently logged or reported in Cassandra, they have exactly the same implications as other types of tombstones and should be avoided where possible. We suggest using the following tools and approaches to detect problems caused by tombstones.</p><h2>Look into “Raw” SSTable Content for Answers</h2><p>When uncertain about performance issues and suspecting tombstones or not knowing what generates tombstones, a good starting point is to inspect the contents of SSTables for the offending table. Use <a href=\"https://docs.datastax.com/en/cassandra/2.2/cassandra/tools/toolsSSTable2Json.html\" target=\"_blank\" rel=\"noopener\">sstable2json</a> (Cassandra sstabledump (Cassandra &gt;= 3.0) to dump a JSON representation of an SSTable to console or file. For example:</p><p>This is especially useful for distinguishing between <code>null</code> values for columns and columns which haven’t been set. For example, consider the following insert statements:</p><p>Statement 1 <strong>will</strong> generate a tombstone for <code>col_2</code>, statement 2 <strong>will not</strong>, it will not create column <code>col_2</code> for key 555 at all. You can see it in the JSON representation of the SSTable:</p><p>However, the data is displayed identically in CQL format, you will not be able to find tombstones caused by <code>null</code> values by looking at <code>SELECT</code> output:</p><p>It is also the only way to confirm existence of column range tombstones which are not logged by Cassandra and accordingly are not reported by any tools and metrics.</p><h2>Set the appropriate <code>gc_grace_seconds</code> on tables</h2><p>Routine repairs must be run on clusters where deletions occur (they may occur even if you don’t explicitly delete anything, see above) to avoid among other things deleted data becoming live again. You must run repairs more often than the <strong>minimum</strong> chosen <code>gc_grace_period</code> (<a href=\"https://docs.datastax.com/en/cassandra/2.2/cassandra/operations/opsRepairNodesWhen.html\" target=\"_blank\" rel=\"noopener\">see this article for more details</a>). Make sure you are capable of supporting repairs more frequent than the minimum <code>gc_grace_seconds</code> among all your tables.</p><h2>Changing the tombstone warning / failure threshold</h2><p>Invisible column range tombstones aside, there are two tombstone threshold settings in <code>cassandra.yaml</code> helpful for detecting a large number of tombstones affecting performance:<br />– <code>tombstone_warn_threshold</code> (default: 1000): if the number of tombstones scanned by a query exceeds this number Cassandra will <strong>log a warning</strong> (which will likely be propagating to your monitoring system and send you an alert).<br />– <code>tombstone_failure_threshold</code> (default: 10000): if the number of tombstones scanned by a query exceeds this number Cassandra will <strong>abort the query</strong>. The is a mechanism to prevent one or more nodes from running out of memory and crashing.</p><p>These values should only be changed upwards if you are really confident about the memory use patterns in your cluster.</p><h2>Conclusion</h2><p>Tombstones are among the most misunderstood features of Cassandra and can cause significant performance problems if not investigated, monitored and dealt with in a timely manner. OpenCredo has acquired expertise in detecting and solving tombstone related problems on various projects by successfully using the tools shared above.</p><h4>This is the fourth (and last) post in our blog series “Cassandra – What You May Learn The Hard Way.” Get the full overview <a href=\"https://opencredo.com/?p=28779\" target=\"_blank\" rel=\"noopener\">here</a>.</h4><h4>The associated webinar, “Cassandra – The Good, the Bad, and the Ugly” was broadcast on October 6th, 2016. View the recording <strong><a href=\"https://opencredo.com/?p=28889\"> here</a>.</strong></h4><h4><a class=\"button\" href=\"#text_icl-6\">Sign up to receive updates via email</a></h4></div></div></section><section class=\"bg-white text-blue pt-60 pb-60\"><div class=\"wrapper\"><p>&#13;\n\t\t\t\t\t</p><h2 class=\"mb-30 text-16 font-bold\">SIMILAR POSTS</h2>&#13;<div class=\"flex flex-wrap w-full lg:w-5/6 justify-center\"><div class=\"owl-carousel owl-carousel-insights flex items-stretch mb-30 md:mb-30 pl-0 sm:pl-30 pr-0 sm:pr-30 lg:pl-0 lg:pr-0\"><div class=\"bg-orange h-full\"><a href=\"https://opencredo.com/blogs/riak-the-dynamo-paper-and-life-beyond-basho/\" title=\"Read More\"><img src=\"https://15rf562os5r61q4tvf2630fw-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/banner-case-studies-297x236.jpg\" alt=\"Riak, the Dynamo paper and life beyond Basho\" class=\"block w-full\" /></a><div class=\"text-white p-30\"><p class=\"text-18 mb-30\"><a href=\"https://opencredo.com/blogs/riak-the-dynamo-paper-and-life-beyond-basho/\" class=\"text-white no-underline font-bold\">Riak, the Dynamo paper and life beyond Basho</a></p>Recently, the sad news has emerged that Basho, which developed the Riak distributed database, has gone into receivership. This would appear to present a problem…<p><a href=\"https://opencredo.com/blogs/riak-the-dynamo-paper-and-life-beyond-basho/\" class=\"text-white no-underline font-bold\">Read More <img src=\"https://15rf562os5r61q4tvf2630fw-wpengine.netdna-ssl.com/wp-content/themes/wp-ocd/assets/img/arrow-white.png\" alt=\"Read More\" class=\"h-16 ml-7.5\" /></a></p></div></div><div class=\"bg-orange h-full\"><a href=\"https://opencredo.com/blogs/spark-testing/\" title=\"Read More\"><img src=\"https://15rf562os5r61q4tvf2630fw-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/banner-expertise-297x236.jpg\" alt=\"Testing a Spark Application\" class=\"block w-full\" /></a><div class=\"text-white p-30\"><p class=\"text-18 mb-30\"><a href=\"https://opencredo.com/blogs/spark-testing/\" class=\"text-white no-underline font-bold\">Testing a Spark Application</a></p>Data analytics isn’t a field commonly associated with testing, but there’s no reason we can’t treat it like any other application. Data analytics services are…<p><a href=\"https://opencredo.com/blogs/spark-testing/\" class=\"text-white no-underline font-bold\">Read More <img src=\"https://15rf562os5r61q4tvf2630fw-wpengine.netdna-ssl.com/wp-content/themes/wp-ocd/assets/img/arrow-white.png\" alt=\"Read More\" class=\"h-16 ml-7.5\" /></a></p></div></div><div class=\"bg-orange h-full\"><a href=\"https://opencredo.com/blogs/deploy-spark-apache-cassandra/\" title=\"Read More\"><img src=\"https://15rf562os5r61q4tvf2630fw-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/banner-services-297x236.jpg\" alt=\"Deploy Spark with an Apache Cassandra cluster\" class=\"block w-full\" /></a><div class=\"text-white p-30\"><p class=\"text-18 mb-30\"><a href=\"https://opencredo.com/blogs/deploy-spark-apache-cassandra/\" class=\"text-white no-underline font-bold\">Deploy Spark with an Apache Cassandra cluster</a></p>My recent blogpost I explored a few cases where using Cassandra and Spark together can be useful. My focus was on the functional behaviour of…<p><a href=\"https://opencredo.com/blogs/deploy-spark-apache-cassandra/\" class=\"text-white no-underline font-bold\">Read More <img src=\"https://15rf562os5r61q4tvf2630fw-wpengine.netdna-ssl.com/wp-content/themes/wp-ocd/assets/img/arrow-white.png\" alt=\"Read More\" class=\"h-16 ml-7.5\" /></a></p></div></div></div><a href=\"https://opencredo.com/blogs/\" class=\"btn hover-scale-105 text-18\">Blog</a></div></div></section><noscript>\n<div id=\"catapult-cookie-bar\" class=\"\"><p>This website uses cookies to maximise your experience and help us to understand how we can improve it. By continuing to browse this website or by clicking 'Accept', you consent to the use of cookies. If you would like to manage your cookie settings, you can control this in your internet browser. </p></div>\t</noscript></section>"}}]}},"pageContext":{"alternative_id":13121}}