{"data":{"allAnantCassandralinks":{"edges":[{"node":{"title":"Deploy DataStax Enterprise (DSE) on the AWS Cloud with New Quick Start","alternative_id":12067,"content":"<p>DSE is the always-on data platform for cloud applications that is powered by Apache Cassandra. DSE is designed to handle big data workloads across multiple nodes with no single point of failure, by employing a peer-to-peer distributed system for data across homogeneous nodes. Integrated within each node of DSE is powerful indexing, search, analytics, and graph functionality, provided by combining Cassandra with Apache Solr, Apache Spark, and DSE Graph.</p><p>This Quick Start uses AWS CloudFormation templates to deploy DSE into a virtual private cloud (VPC) in your AWS account. You can build a new VPC for DSE, or deploy the software into your existing VPC. The automated deployment provisions an Amazon Elastic Compute Cloud (Amazon EC2) instance running DSE OpsCenter, which is the web console for managing DSE clusters. The Quick Start also provisions EC2 instances for up to four DSE data centers to support workload separation, and sets up a configurable number of nodes in each data center. You can also customize your network resources, and modify the instance type and volume size for each node.</p><p>The Quick Start includes a guide with step-by-step deployment and configuration instructions. To get started, use the following resources:</p><ul><li>View the <a href=\"https://aws.amazon.com/quickstart/architecture/datastax-enterprise/\">architecture and details</a></li> \n           <li>View the <a href=\"https://fwd.aws/VP83q\" target=\"_blank\">deployment guide</a></li> \n           <li>Browse and launch other <a href=\"https://aws.amazon.com/quickstart/\">AWS Quick Start reference deployments</a></li> \n          </ul><p><i>About Quick Starts</i></p><p><i>Quick Starts are automated reference deployments for key workloads on the AWS Cloud. Each Quick Start launches, configures, and runs the AWS compute, network, storage, and other services required to deploy a specific workload on AWS, using AWS best practices for security and availability. This is the latest in a series of Quick Starts built by AWS in collaboration with AWS partners to automate the deployment of popular products and technologies on AWS.</i></p>"}}]}},"pageContext":{"alternative_id":12067}}