{"data":{"allAnantCassandralinks":{"edges":[{"node":{"title":"instaclustr/cassandra-docker","alternative_id":11801,"content":"<article class=\"markdown-body entry-content\" itemprop=\"text\">\n<p>This is the Instaclustr public docker image for Apache Cassandra.\nIt contains docker images for Cassandra 3.0 and 3.11.1.</p>\n<p>It contains some of our best practices and lessons learnt from running Cassandra on docker for the last 4 years over 1000's of clusters.\nIt also supports configuration via environment variables in the same manner as the <a href=\"https://hub.docker.com/_/cassandra/\" rel=\"nofollow\">official docker cassandra image</a></p>\n<p>Primary configuration of Cassandra should be done by creating a volume mount on the Cassandra config\ndirectory and providing configuration externally (manually, docker swarm, k8s), however support for\nbasic configuration via environment variables does exist. See below.</p>\n<p>Current status: <strong>Beta</strong></p>\n<h2><a id=\"user-content-start-a-cassandra-server-instance\" class=\"anchor\" aria-hidden=\"true\" href=\"#start-a-cassandra-server-instance\"></a>Start a <code>cassandra</code> server instance</h2>\n<p>Prebuilt images can be fetched by running:</p>\n<div class=\"highlight highlight-text-shell-session\"><pre>docker pull instaclustr/cassandra</pre></div>\n<p>Starting a Cassandra instance is simple:</p>\n<div class=\"highlight highlight-text-shell-session\"><pre>$ docker run --name some-cassandra -d cassandra:tag</pre></div>\n<p>... where <code>some-cassandra</code> is the name you want to assign to your container and <code>tag</code> is the tag specifying the Cassandra version you want. See the list above for relevant tags.</p>\n<h2><a id=\"user-content-where-to-store-data\" class=\"anchor\" aria-hidden=\"true\" href=\"#where-to-store-data\"></a>Where to Store Data</h2>\n<p>Important note: There are several ways to store data used by applications that run in Docker containers. We encourage users of the <code>cassandra</code> images to familiarize themselves with the options available, including:</p>\n<ul><li>Let Docker manage the storage of your database data <a href=\"https://docs.docker.com/engine/tutorials/dockervolumes/#adding-a-data-volume\" rel=\"nofollow\">by writing the database files to disk on the host system using its own internal volume management</a>. This is the default and is easy and fairly transparent to the user. The downside is that the files may be hard to locate for tools and applications that run directly on the host system, i.e. outside containers. Performance will also suffer, this is generally recommended for non production environments.</li>\n<li>Create a data directory on the host system (outside the container) and <a href=\"https://docs.docker.com/engine/tutorials/dockervolumes/#mount-a-host-directory-as-a-data-volume\" rel=\"nofollow\">mount this to a directory visible from inside the container</a>. This places the database files in a known location on the host system, and makes it easy for tools and applications on the host system to access the files. The downside is that the user needs to make sure that the directory exists, and that e.g. directory permissions and other security mechanisms on the host system are set up correctly.</li>\n</ul><p>The Docker documentation is a good starting point for understanding the different storage options and variations, and there are multiple blogs and forum postings that discuss and give advice in this area. We will simply show the basic procedure here for the latter option above:</p>\n<ol><li>\n<p>Create a data directory on a suitable volume on your host system, e.g. <code>/my/own/datadir</code>.</p>\n</li>\n<li>\n<p>Start your <code>cassandra</code> container like this:</p>\n<div class=\"highlight highlight-text-shell-session\"><pre>$ docker run --name some-cassandra -v /my/own/datadir:/var/lib/cassandra -d cassandra:tag</pre></div>\n</li>\n</ol><p>The <code>-v /my/own/datadir:/var/lib/cassandra</code> part of the command mounts the <code>/my/own/datadir</code> directory from the underlying host system as <code>/var/lib/cassandra</code> inside the container, where Cassandra by default will write its data files.</p>\n<p>Note that users on host systems with SELinux enabled may see issues with this. The current workaround is to assign the relevant SELinux policy type to the new data directory so that the container will be allowed to access it:</p>\n<div class=\"highlight highlight-text-shell-session\"><pre>$ chcon -Rt svirt_sandbox_file_t /my/own/datadir</pre></div>\n<p>The Cassandra configuration directory (/etc/cassandra) can be managed by docker as a docker volume as appropriate for you environment if you are not using environment variable based configuration.\nThe Cassandra data directory however should generally be a bind mount to a directory on the host with an appropriately configured file system\n(e.g. XFS with a readahead value of 8).</p>\n<p>This docker file does not yet support block device passthrough via the device flag.</p>\n<h2><a id=\"user-content-configuring-the-kernel\" class=\"anchor\" aria-hidden=\"true\" href=\"#configuring-the-kernel\"></a>Configuring the kernel</h2>\n<p>To optimally run Cassandra, the kernal and a few other parameters for the process need to be tuned. Most of these can be done via the docker command being run:</p>\n<div class=\"highlight highlight-text-shell-session\"><pre>--cap-add=IPC_LOCK --ulimit memlock=-1 --ulimit nofile=100000 --ulimit nproc=32768</pre></div>\n<p>Some sysctl suggestions will need to be set at the docker host level as docker is limited in what tuneables it can modify.\nE.g. changes to the sysctl <code>vm.max_map_count</code></p>\n<p>When utilisting this image with Kubernetes, you can create a privileged init container that will set up the correct sysctl properties\nfor the kubernetes node. Allowing the Cassandra to be run as a non privileged container whilst still being configured correctly.\nFor example:</p>\n<h2><a id=\"user-content-injecting-configuration\" class=\"anchor\" aria-hidden=\"true\" href=\"#injecting-configuration\"></a>Injecting configuration</h2>\n<p>To provide your own configuration for Cassandra, via a user provided cassandra.yaml, cassandra-env.sh, jvm.properties, rack-dc.properties file etc.\nYou can volume mount the configration directory or use some other configuration management capability (e.g. kubernetes configMaps)</p>\n<div class=\"highlight highlight-text-shell-session\"><pre>$ docker run --name some-cassandra -v /my/own/configdir:/etc/cassandra -d cassandra:tag</pre></div>\n<p>Configuring Cassandra in this manner is not compatible with legacy configuration via <code>CASSANDRA_ENV_OVERRIDES</code>.</p>\n<h2><a id=\"user-content-legacy-configuration\" class=\"anchor\" aria-hidden=\"true\" href=\"#legacy-configuration\"></a>Legacy configuration</h2>\n<p>This docker images supports configuration via environment variables as well similar to the docker-library image see <a href=\"https://github.com/instaclustr/cassandra-docker/blob/master/LEGACY.md\">legacy documentation</a></p>\n<h2><a id=\"user-content-elassandra\" class=\"anchor\" aria-hidden=\"true\" href=\"#elassandra\"></a>Elassandra</h2>\n<p>Instaclustr cassandra docker images currently support Elassandra via <a href=\"https://github.com/zegelin/cassandra-docker\">https://github.com/zegelin/cassandra-docker</a>. Elassandra images can be pulled from docker hub via <code>docker pull instaclustr/cassandra:elassandra-5.5.0.13</code>\nExamples can be found in the example directory. Elassandra does not support environment variable configuration.</p>\n</article>"}}]}},"pageContext":{"alternative_id":11801}}