{"data":{"allAnantCassandralinks":{"edges":[{"node":{"title":"Instaclustr Open-sources Cassandra sstable Analysis Tools","alternative_id":12166,"content":"<p>At Instaclustr we spend a lot of time managing Cassandra clusters – we have team of engineers that 24×7 do nothing but manage Cassandra clusters. Big clusters, tiny clusters, clusters with awesome data models and clusters with less awesome data models – we manage them all.</p><p>Over time, we’ve developed a lot of tricks and tools to help us in this job. We’re happy to announce that, as part of our commitment to the <a href=\"https://www.instaclustr.com/apache-cassandra/\">Apache Cassandra</a> open source community, we’re making our most generally useful tools available for open use.</p><p>The tools (that we’ve imaginatively called ic-tools) supplement the information available from the nodetool utility that is part of core <a href=\"https://www.instaclustr.com/apache-cassandra/\">Apache Cassandra</a>. Whereas nodetool tends to report based on summary statistics maintained as Cassandra services operate, ic-tools directly reads Cassandra’s data files when executed. This allows reporting of more detailed and accurate statistics.</p><p>We’ve found the information available from these tools to be invaluable in answering questions to help diagnose Cassandra issues or just better understand what Cassandra is doing with your data. The information available from the tools is pretty broad. Some highlights that will resonate with many Cassandra users include:</p><ul><li>Partition keys of the largest partitions by data size, number of columns and sstables spanned</li> <li>Information about data age (timespan) of data in sstables</li> <li>Tombstone information including partition keys of partitions with the most tombstones and calculation of potentially reclaimable space if/when tombstones are purged</li> </ul><p>This is just a highlights list of key data. See the <a href=\"https://instaclustr.zendesk.com/hc/en-us/articles/235656328\">help page</a> and examples below for a more complete list.</p><p>The tools are available on a supported basis for our enterprise support customers and on an unsupported basis for the general community (although we’ll probably answer questions on the C* user email list). For users of <a href=\"https://www.instaclustr.com/platform/\">Instaclustr’s Managed Service</a>, our Technical Operations team will run these as needed when working with you to help diagnose issues.</p><p>The source code is published on our <a href=\"https://github.com/instaclustr/cassandra-sstable-tools\">github</a>. We’re more than happy to take pull requests and other suggestions for improvements. We’ll also be talking to the C* project to see if any of this code makes sense in the core project.</p><p>We hope these tools will be as useful for the rest of the Cassandra community as we’ve found them in our work. Let us know in the comments if you have any feedack.</p><div class=\"foogallery foogallery-container foogallery-image-viewer foogallery-link-image foogallery-lightbox-foobox-free fg-center fg-image-viewer fg-light fg-border-thin fg-shadow-outline fg-loading-default fg-loaded-fade-in\" id=\"foogallery-gallery-4274\" data-foogallery=\"{&quot;item&quot;:{&quot;showCaptionTitle&quot;:false,&quot;showCaptionDescription&quot;:true},&quot;lazy&quot;:true,&quot;src&quot;:&quot;data-src-fg&quot;,&quot;srcset&quot;:&quot;data-srcset-fg&quot;}\" data-fg-common-fields=\"1\"><div class=\"fiv-inner\"><div class=\"fiv-ctrls\"><p>Prev</p><label class=\"fiv-count\">1of5</label><p>Next</p></div></div></div><p>Rotate through the gallery above for more information.</p>"}}]}},"pageContext":{"alternative_id":12166}}