{"data":{"allAnantCassandralinks":{"edges":[{"node":{"title":"Introduction to the Azure Cosmos DB Cassandra API","alternative_id":12001,"content":"<ul class=\"metadata page-metadata\" data-bi-name=\"page info\" lang=\"en-us\" dir=\"ltr\">\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t<li class=\"contributors-holder\">&#13;\n\t\t\t\t\t\t\t\tContributors&#13;\n\t\t\t\t\t\t\t\t</li>\n\n\t\t\t\t\t\t</ul><p>Azure Cosmos DB provides the Cassandra API (preview) for applications that are written for Apache Cassandra that need premium capabilities like:</p>\n<ul><li><a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/partition-data\" data-linktype=\"relative-path\">Scalable storage size and throughput</a>.</li>\n<li><a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/distribute-data-globally\" data-linktype=\"relative-path\">Turn-key global distribution</a></li>\n<li>Single-digit millisecond latencies at the 99th percentile.</li>\n<li><a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/consistency-levels\" data-linktype=\"relative-path\">Five well-defined consistency levels</a></li>\n<li><a href=\"http://www.vldb.org/pvldb/vol8/p1668-shukla.pdf\" data-linktype=\"external\">Automatic indexing of data</a> without requiring you to deal with schema and index management. </li>\n<li>Guaranteed high availability, all backed by <a href=\"https://azure.microsoft.com/support/legal/sla/cosmos-db/\" data-linktype=\"external\">industry-leading SLAs</a></li>\n</ul><h2 id=\"what-is-the-azure-cosmos-db-apache-cassandra-api\">What is the Azure Cosmos DB Apache Cassandra API?</h2>\n<p>Azure Cosmos DB can be used as the data store for apps written for <a href=\"https://cassandra.apache.org/\" data-linktype=\"external\">Apache Cassandra</a>, by using the Apache Cassandra API. This means that by using existing <a href=\"https://cassandra.apache.org/doc/latest/getting_started/drivers.html?highlight=driver\" data-linktype=\"external\">Apache licensed drivers compliant with CQLv4</a>, your application written for Cassandra can now communicate with the Azure Cosmos DB Cassandra API. In many cases, you can switch from using Apache Cassandra to using Azure Cosmos DB 's Apache Cassandra API, by simply changing a connection string. Using this functionality, you can easily build and run Cassandra API database applications in the Azure cloud with Azure Cosmos DB's global distribution and <a href=\"https://azure.microsoft.com/support/legal/sla/cosmos-db\" data-linktype=\"external\">comprehensive industry-leading SLAs</a>, while continuing to use familiar skills and tools for Cassandra API.</p>\n<p><img src=\"https://docs.microsoft.com/en-us/azure/cosmos-db/media/cassandra-introduction/cosmosdb-cassandra.png\" alt=\"Azure Cosmos DB Cassandra API\" data-linktype=\"relative-path\" /></p>\n<p>The Cassandra API enables you to interact with data stored in Azure Cosmos DB using the Cassandra Query Language based tools (like CQLSH) and Cassandra client drivers you’re already familiar with. Learn more about it in this Microsoft Mechanics video with Principal Engineering Manager Kirill Gavrylyuk.</p>\n<h2 id=\"what-is-the-benefit-of-using-apache-cassandra-api-for-azure-cosmos-db\">What is the benefit of using Apache Cassandra API for Azure Cosmos DB?</h2>\n<p><strong>No operations management</strong>: As a true fully managed service, Azure Cosmos DB ensures that Cassandra API administrators do not have to worry about managing and monitoring a myriad settings across OS, JVM, and yaml files and their interplay. Azure Cosmos DB provides monitoring of throughput, latency, storage and availability, and configurable alerts. </p>\n<p><strong>Performance management</strong>: Azure Cosmos DB provides SLA backed low latency reads and writes for the 99th percentile. Users do not need to worry about lot of operational overhead to provide good read and write SLAs. These typically include scheduling compaction, managing tombstones, bloom filters setting, and replica lags. Azure Cosmos DB takes away the worry of managing these issues and lets you focus on the application deliverables.</p>\n<p><strong>Automatic indexing</strong>: Azure Cosmos DB automatically indexes all the columns of table in Cassandra API database. Azure Cosmos DB  does not require creation of secondary indices to speed up queries. It provides low latency read and write experience while doing automatic consistent indexing. </p>\n<p><strong>Ability to use existing code and tools</strong>: Azure Cosmos DB provides wire protocol level compatibility with existing SDKs and tools. This compatibility ensures you can use your existing codebase with Cassandra API of Azure Cosmos DB with trivial changes.</p>\n<p><strong>Throughput and storage elasticity</strong>: Azure Cosmos platform provides elasticity of guaranteed throughput across regions via simple portal, PowerShell, or CLI operations. You can elastically scale Azure Cosmos DB Tables with predictable performance seamlessly as your application grows. Azure Cosmos DB supports Cassandra API tables that can scale to virtually unlimited storage sizes. </p>\n<p><strong>Global distribution and availability</strong>: Azure Cosmos DB provides the ability to distribute data throughout Azure regions to enable  users with a low latency experience while ensuring availability. Azure Cosmos DB provides 99.99% availability within a region and 99.999% read availability across the regions with no operations overhead. Azure Cosmos DB is available in 30+ <a href=\"https://azure.microsoft.com/regions/services/\" data-linktype=\"external\">Azure Regions</a>. Learn more in <a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/distribute-data-globally\" data-linktype=\"relative-path\">Distribute data globally</a>. </p>\n<p><strong>Choice of consistency</strong>: Azure Cosmos DB provides the choice of five well-defined consistency levels to achieve optimal trade-off between consistency and performance. These consistency levels are strong, bounded-staleness, session, consistent prefix, and eventual. These granular, well-defined consistency levels allow developer to make sound trade-offs between consistency, availability, and latency. Learn more in <a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/consistency-levels\" data-linktype=\"relative-path\">Using consistency levels to maximize availability and performance</a>. </p>\n<p><strong>Enterprise grade</strong>: Azure cosmos DB provides <a href=\"https://www.microsoft.com/trustcenter\" data-linktype=\"external\">compliance certifications</a> to ensure users can use the platform securely. Azure Cosmos DB also provides encryption at rest and in motion, IP firewall, and audit logs for control plane activities.  </p>\n<p>If you already have an Azure subscription, you can sign up to join the Cassandra API (preview) program in the <a href=\"https://aka.ms/cosmosdb-cassandra-signup\" data-linktype=\"external\">Azure portal</a>.  If you’re new to Azure, sign up for a <a href=\"https://azure.microsoft.com/free\" data-linktype=\"external\">free trial</a> where you get 12 months of free access to Azure Cosmos DB. Complete the following steps to request access to the Cassandra API (preview) program.</p>\n<ol><li><p>In the <a href=\"https://portal.azure.com\" data-linktype=\"external\">Azure portal</a>, click <strong>Create a resource</strong> &gt; <strong>Databases</strong> &gt; <strong>Azure Cosmos DB</strong>. </p>\n</li>\n<li><p>In the New Account page, select <strong>Cassandra</strong> in the API box. </p>\n</li>\n<li><p>In the <strong>Subscription</strong> box, select the Azure subscription that you want to use for this account.</p>\n</li>\n<li><p>Click <strong>Sign up to preview today</strong>.</p>\n<p> <img src=\"https://docs.microsoft.com/en-us/azure/cosmos-db/media/cassandra-introduction/cassandra-sign-up.png\" alt=\"Azure Cosmos DB Cassandra API\" data-linktype=\"relative-path\" /></p>\n</li>\n<li><p>In the Sign up to preview today pane, click <strong>OK</strong>. </p>\n<p> Once you submit the request, the status changes to <strong>Pending approval</strong> in the New account pane. </p>\n</li>\n</ol><p>After you submit your request, wait for email notification that your request has been approved. Due to the high volume of requests, you should receive notification within a week. You do not need to create a support ticket to complete the request. Requests will be reviewed in the order in which they were received. </p>\n<h2 id=\"how-to-get-started\">How to get started</h2>\n<p>Once you've joined the preview program, follow the Cassandra API quickstarts to create an app by using the Cassandra API:</p>\n<ul><li><a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/create-cassandra-nodejs\" data-linktype=\"relative-path\">Quickstart: Build a Cassandra web app with Node.js and Azure Cosmos DB</a></li>\n<li><a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/create-cassandra-java\" data-linktype=\"relative-path\">Quickstart: Build a Cassandra web app with Java and Azure Cosmos DB</a></li>\n<li><a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/create-cassandra-dotnet\" data-linktype=\"relative-path\">Quickstart: Build a Cassandra web app with .NET and Azure Cosmos DB</a></li>\n<li><a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/create-cassandra-python\" data-linktype=\"relative-path\">Quickstart: Build a Cassandra web app with Python and Azure Cosmos DB</a></li>\n</ul><h2 id=\"next-steps\">Next steps</h2>\n<p>Information about the Azure Cosmos DB Cassandra API is integrated into the overall Azure Cosmos DB documentation, but here are a few pointers to get you started:</p>\n<ul><li>Follow the <a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/create-cassandra-nodejs\" data-linktype=\"relative-path\">Quickstarts</a> to create an account and a new app by using a Git sample</li>\n<li>Follow the <a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/tutorial-develop-cassandra-java\" data-linktype=\"relative-path\">Tutorial</a> to create a new app programmatically.</li>\n<li>Follow the <a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/cassandra-import-data\" data-linktype=\"relative-path\">Import Cassandra data tutorial</a> to import your existing data into Azure Cosmos DB.</li>\n<li>Read the <a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/faq#cassandra\" data-linktype=\"relative-path\">FAQ</a>.</li>\n</ul>"}}]}},"pageContext":{"alternative_id":12001}}