{"data":{"allAnantCassandralinks":{"edges":[{"node":{"title":"instaclustr/cassandra-ldap","alternative_id":11802,"content":"<p>This is a pluggable authentication implementation for Apache Cassandra, providing a way to authenticate and create users based on a configured LDAP server.\nThis implementation purely provides authentication only. Role management must be performed through the usual Cassandra role management, CassandraAuthorizer. See <strong>How it works</strong> for more details.</p><p>There are separate branches for each supported version of Apache Cassandra. Each branch should work with any corresponding minor version of the same branch in Cassandra.\nBuilding the jar requires Apache maven.\nClone and checkout the desired branch.</p><pre>git clone https://github.com/instaclustr/cassandra-ldap/\ngit checkout 3.11\n</pre><p>Compile and package</p><pre>mvn package\n</pre><p>From the git repo, fill in and copy the <code>ldap.properties</code> file to some location ($CASSANDRA_CONF is a good one) on each of the nodes. This file is used for telling the authenticator details about the LDAP server and connection.</p><p>Copy the created jar file to each node in your cluster, and append it to the CLASSPATH variable in the cassandra-env.sh/cassandra-env.ps1)</p><pre>CLASSPATH=\"$CLASSPATH:/path/to/cassandra-ldap-3.11.2.jar\"\n</pre><p>Also add the following option to the JVM options, pointing to the location of your ldap.properties file (on each node).</p><pre>JVM_OPTS=\"$JVM_OPTS -Dldap.properties.file=$CASSANDRA_CONF/ldap.properties\"\n</pre><p>In your <code>cassandra.yaml</code> configure the authenticator <strong>and authorizer</strong> like so:</p><pre>authenticator: com.instaclustr.cassandra.ldap.LDAPAuthenticator\nauthorizer: CassandraAuthorizer\n</pre><p>Configure credential caching parameters in <code>cassandra.yaml</code>.\n[Re]start Cassandra.</p><p><strong>WARNING</strong> - Doing this on a live cluster should be handled with care. If done in a rolling fashion from PasswordAuthenticator (or some other implementation) connections to an LDAP configured node using non-ldap credentials will fail if usernames and passwords don't match, that is, nodes running LDAPAuthenticator will not be able to access Cassandra users that are <em>not</em> in LDAP. Safest method would be to either support both mechanisms in your application (handle failure with C* users) or switch to AllowAllAuthenticator (in a rolling fashion) prior to switching to LDAPAuthenticator.</p><p>LDAPAuthenticator currently supports plain text authorisation requests only in the form of a username and password. This request is made to the LDAP server over plain text, so you should be using client encryption on the Cassandra side and secure ldap (ldaps) on the LDAP side.</p><p>Credentials are sent from your client to the Cassandra server and then tested against the LDAP server for authentication using a specified service account. This service account should be configured in the <code>ldap.properties</code> file using the <code>service_dn</code> and <code>service_password</code> properties. This can be excluded if you allow anonymous access to ldap (not recommended unless you know what you're doing!).</p><p>On successful authentication to LDAP a corresponding Cassandra user will be created (including for the service user who will be SUPERUSER). These users are never removed, as it is deemed cleanup is not necessary as long as auth is still handled by LDAP. Manual cleanup of users will work fine, and if they re-auth a replacement user will be created. Passwords are not stored in Cassandra, however on 3.11 and later will live in the credentials cache when used.</p><ul><li>See blog by Kurt Greaves <a href=\"https://www.instaclustr.com/apache-cassandra-ldap-authentication/\" rel=\"nofollow\">\"Apache Cassandra LDAP Authentication\"</a></li>\n</ul>"}}]}},"pageContext":{"alternative_id":11802}}