{"data":{"allAnantCassandralinks":{"edges":[{"node":{"title":"Dear Cassandra Developers, welcome to Azure #CosmosDB!","alternative_id":9291,"content":"<div class=\"blog-author\"><div class=\"image\"><img src=\"https://gravatar.com/avatar/c9eeeb5a06664a4e4e19e63d272ab774?s=62\" alt=\"\" role=\"presentation\" /></div><p>GPM, Azure Cosmos DB + Open Source Software Analytics</p></div><div class=\"blog-postContent\" lang=\"en\"><p>Today we're excited to launch native support for <strong>Apache Cassandra API in Azure Cosmos DB</strong> – offering you Cassandra as-a-service powered by Azure Cosmos DB. You can now experience the power of <a href=\"https://azure.microsoft.com/en-us/blog/a-technical-overview-of-azure-cosmos-db/\">Azure Cosmos DB</a> platform as a managed service with the familiarity of your favorite Cassandra SDKs and tools—without any app code changes.</p><p><a href=\"https://azure.microsoft.com/en-us/blog/azure-cosmos-db-microsofts-globally-distributed-multi-model-database-service/\">Azure Cosmos DB</a> is the industry’s first fully managed globally distributed, massively scalable, and multi-model database service. It is designed to allow developers to elastically scale throughput and storage across any number of geographical regions worldwide—backed by industry-leading comprehensive <a href=\"https://azure.microsoft.com/en-us/support/legal/sla/cosmos-db/v1_1/\">SLAs</a> including throughput, availability, consistency, and &lt;10ms latency guarantees.</p><p><a href=\"https://azurecomcdn.azureedge.net/mediahandler/acomblog/media/Default/blog/21dfc07f-ebce-45d2-b956-4d4f7761d6fc.png\"><img alt=\"image\" border=\"0\" height=\"226\" src=\"https://azurecomcdn.azureedge.net/mediahandler/acomblog/media/Default/blog/b5cce20b-327a-4d89-a1aa-c4822bf28376.png\" title=\"image\" width=\"624\" /></a></p><h2 style=\"text-align: left;\">Bring your Cassandra apps to Azure Cosmos DB in 3 simple steps:</h2><ol><li>Create a new Azure Cosmos DB account in the Azure Portal and choose the new Cassandra API while creating an Azure Cosmos DB account.</li> <li>Connect your Cassandra application to Azure Cosmos DB copying a simple connection code snippet provided to you upon creation of your new account.</li> <li>Use your favorite Cassandra tools and drivers to manage and query your Cassandra data in Azure Cosmos DB</li> </ol><p style=\"text-align: left;\">This <a href=\"https://www.youtube.com/watch?v=1Sf4McGN1AQ&amp;feature=youtu.be\">short video</a> shows how easy and quickly it is to get started with Azure Cosmos DB’s native support for Apache Cassandra API.<a href=\"https://www.youtube.com/watch?v=1Sf4McGN1AQ&amp;feature=youtu.be\"><img alt=\"image\" border=\"0\" height=\"351\" src=\"https://azurecomcdn.azureedge.net/mediahandler/acomblog/media/Default/blog/acf435ae-0aeb-48af-b8e1-e17c22d21fbd.png\" title=\"image\" width=\"498\" /></a></p><h2>Enterprise-grade, battle-tested platform for your Cassandra apps</h2><blockquote><div>&#13;\n<p>“We are using the Cassandra API on Azure Cosmos DB for several mission-critical use cases. In particular, the geo-redundancy and dynamic scale of the solution are key advantages and we look forward to reaping more benefits in the future.”</p>&#13;\n&#13;\n<p style=\"text-align: right;\">- Christoph Leinemann, Senior Director, Data Engineering, <a href=\"https://jet.com/\">Jet.com</a></p>&#13;\n</div></blockquote><p>With Azure Cosmos DB’s native support for Cassandra APIs you will get the following benefits:</p><ul><li><strong>Fully managed, serverless Cassandra as-a-service</strong>. As a <a href=\"https://azure.microsoft.com/en-us/blog/azure-cosmos-db-microsofts-globally-distributed-multi-model-database-service/\">true PaaS service</a>, Azure Cosmos DB ensures that you do not have to worry about managing and monitoring myriad of settings across OS, JVM and YAML files and deal with complex interdependencies. Azure Cosmos DB provides first-class monitoring of throughput, latency, consistency, storage and availability and configurable alerts to take action on changes across them.</li> <li><strong>Turnkey global distribution</strong>. Azure Cosmos DB was designed as a <a href=\"https://azure.microsoft.com/en-us/blog/a-technical-overview-of-azure-cosmos-db/\">globally distributed service from the ground up</a> to ensure that your data is made available wherever your users are. The service transparently and automatically replicates the data across any number of Azure regions associated with your Cassandra tables. You can add or remove regions for your Cassandra tables with a few clicks in Azure portal or programmatically, at any time. </li> <li><strong>Elastic and transparent scaling of storage</strong>. Azure Cosmos DB provides <a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/partition-data\">automatic storage management</a> without the need for any manual intervention and grows the capacity as your application storage needs increase. You don’t need to worry about the complexities of capacity planning or having to deal with adding cluster nodes and tuning configs anymore.</li> <li><strong>Elastic scaling of throughput all around the world</strong>. With Azure Cosmos DB you don’t need to worry about tuning config settings for CPU, memory, disk IO, and compaction. Azure Cosmos DB allows you to <a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/request-units\">scale throughput</a> for your Cassandra tables all around the world and guarantees the configured throughput regardless of the volume of data being stored.</li> <li><strong>Guaranteed low latency reads and writes</strong>. As the first and only schema-agnostic database, Azure Cosmos DB automatically indexes all your data so you can perform blazing fast queries. The service offers guaranteed &lt;10 ms latencies at the 99th percentile for near real-time query results.</li> <li><strong>Multiple well-defined consistency models with clear tradeoffs</strong>. Writing correct distributed application logic against an eventually consistent database is often difficult. Azure Cosmos DB helps you by providing five well-defined, intuitive and practical consistency levels, each with a clear trade-off between desired consistency and performance, guaranteed correctness and backed by SLAs. You can now choose from <a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/consistency-levels\">strong, bounded staleness, session, consistent prefix and eventual consistency models</a> and can configure them any time and change on a per request basis.</li> <li><strong>Secure and compliant and enterprise-ready, by default</strong>. Azure Cosmos DB is secure, compliant and enterprise-ready service for mission-critical apps. Azure Cosmos DB has met the stringent compliance standards including <a href=\"https://www.microsoft.com/en-us/trustcenter/compliance/iso-iec-27001\">ISO 27001</a>, <a href=\"https://www.microsoft.com/en-us/trustcenter/compliance/iso-iec-27018\">ISO 27018</a>, <a href=\"https://www.microsoft.com/en-us/trustcenter/compliance/eu-model-clauses\">EUMC</a>, <a href=\"https://www.microsoft.com/en-us/trustcenter/compliance/pci\">PCI DSS</a>, <a href=\"https://www.microsoft.com/en-us/trustcenter/compliance/soc\">SOC 1,2,3</a>, <a href=\"https://www.microsoft.com/en-us/trustcenter/compliance/hipaa\">HIPAA/HITECH</a> and <a href=\"https://www.microsoft.com/en-us/trustcenter/compliance/complianceofferings\">other compliance certifications</a>. Azure Cosmos DB also provides <a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/database-encryption-at-rest\">encryption at rest</a> and in motion, <a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/firewall-support\">IP firewall</a> and <a href=\"https://docs.microsoft.com/en-us/azure/cosmos-db/logging\">audit log for your database activities</a> to ensure demanding security standards of enterprises.</li> <li><strong>Backed by industry leading, comprehensive SLAs</strong>. Azure Cosmos DB provides industry-leading, <a href=\"https://azure.microsoft.com/en-us/support/legal/sla/cosmos-db/v1_1/\">comprehensive SLAs</a> for 99.99% high availability for single region and 99,999% read availability at global scale, consistency, throughput and low latency reads and writes at the 99th percentile. Users do not need to worry about operational overheads and tuning many dozens of configuration options to get good performance. Azure Cosmos DB <a href=\"https://azure.microsoft.com/en-us/blog/azure-documentdb-service-level-agreements/\">takes away the worry of managing all these issues</a> and lets you focus on your application logic instead.</li> </ul><p>Azure Cosmos DB provides <a href=\"https://aka.ms/cassandraintro\">wire protocol level compatibility with the Cassandra API</a>. This ensures you can continue using your existing application and OSS tools with no code changes and gives you the flexibility to run your Cassandra apps fully managed with no vendor lock-in. While Azure Cosmos DB exposes APIs for the popular open source databases, it does not rely on the implementations of those  databases for realizing the semantics of the corresponding APIs. Our unique approach of providing wire-compatible APIs for the popular open sourcedatabases ensures that you can continue to use Azure Cosmos DB in a cloud-agnostic manner while still leveraging a robust database platform natively designed for the cloud.</p><p>Finally, Azure Cosmos DB has been <a href=\"https://azure.microsoft.com/en-us/blog/how-azure-documentdb-planet-scale-nosql-helps-run-microsoft-s-own-businesses/\">used extensively within Microsoft</a> over the years and by some of the largest enterprise customers with their mission critical workloads at an unprecedented global scale. You will now enjoy the same battle-tested, fully managed, globally distributed database service that provides the <a href=\"https://azure.microsoft.com/en-us/updates/documentdb-total-cost-of-non-ownership-paper-available/\">lowest TCO</a> while still using your familiar Cassandra API.</p><h2>Get started today!</h2><p>With Azure Cosmos DB, our mission is to enable the world’s developers to build amazingly powerful, cosmos-scale apps, more easily and today we are excited to welcome the Cassandra developer community!</p><p>Please <a href=\"https://aka.ms/cosmosdb-createcassandra\">sign up</a> to try the <a href=\"https://aka.ms/cassandraintro\">Apache Cassandra API</a> and the new capabilities Azure Cosmos DB can bring to your Cassandra application. After you sign up for a Cassandra API account, get started with our <a href=\"https://aka.ms/cassapidotnetqs\">Quick Start for Cassandra API using .NET</a>, <a href=\"https://aka.ms/cassapijavaqs\">Java</a>, <a href=\"https://aka.ms/cassapinodeqs\">Node.js</a> and <a href=\"https://aka.ms/cassapipython\">Python</a>.</p><p>If you need any help or have questions or feedback, please reach out to us on the <a href=\"https://stackoverflow.com/questions/tagged/azure-cosmosdb\">developer forums on Stack Overflow</a>, and follow us on Twitter <a href=\"https://twitter.com/AzureCosmosDB\">@AzureCosmosDB</a>, <a href=\"https://twitter.com/search?q=%23cosmosDB&amp;src=typd\">#CosmosDB</a>, for the latest news and announcements.</p><p>- Your friends at Azure Cosmos DB</p></div>"}}]}},"pageContext":{"alternative_id":9291}}