{"data":{"allAnantCassandralinks":{"edges":[{"node":{"title":"A Brief History of the SMACK Stack","alternative_id":11768,"content":"<p id=\"d291\" class=\"graf graf--p graf-after--h3\">The term SMACK Stack was widely popularized in the San Francisco/Dublin Scala/Spark/Reactive Systems meetups and By the Bay series of conferences (Scala and Data). Since it took a life of its own, this is an abridged chronology on how it came about. I’m surely missing something, since it’s a view from (by) the Bay — please comment with any corrections or suggestions, as well as updates. I’m not elaborating the technical merits of the SMACK Stack here, as they are covered at <a href=\"http://noetl.org\" data-href=\"http://noetl.org\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">NoETL.org</a>.</p><p id=\"3242\" class=\"graf graf--p graf-after--p\">I’ve first seen the phrase SMACK Stack in a <a href=\"https://twitter.com/jamie_allen/status/614045214018158592\" data-href=\"https://twitter.com/jamie_allen/status/614045214018158592\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">tweet by Jamie Allen</a>, attributed to Oliver White, on June 25, 2015. Jamie is a veteran Typesafe/Lightbend executive and Scala/Akka/Reactive practitioner, and Oliver is their Chief Storyteller. By that time, our long-established plan to run <a href=\"http://2015.bigdatascala.bythebay.io/pipeline.html\" data-href=\"http://2015.bigdatascala.bythebay.io/pipeline.html\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">the first end-to-end data pipeline training</a> at Scala By the Bay and Big Data Scala 2015 was in full smack. We brought together the actual five companies comprising the SMACK Stack with their own trainers, training materials, and top OSS contributors, having worked relentlessly to create the actual SMACK Stack training, defining the SMACK Stack by doing and teaching.</p><p id=\"5350\" class=\"graf graf--p graf-after--p\">The original <a href=\"https://chiefscientist.org/sfscala.org\" data-href=\"sfscala.org\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\">SF Scala</a> announcement went out on December 23, 2014. Here it is:</p><blockquote id=\"fb08\" class=\"graf graf--blockquote graf-after--p\"><div>We are starting two new conferences in 2015: Big Data Scala for complete data pipelines and “big” data science, and Text By the Bay for applied NLP/text mining. Our flagship Scala By the Bay conference continues into its third year, growing to 500, and directly followed by Big Data Scala.</div></blockquote><blockquote id=\"e59b\" class=\"graf graf--blockquote graf-after--blockquote\"><a href=\"https://chiefscientist.org/text.bythebay.io\" data-href=\"text.bythebay.io\" class=\"markup--anchor markup--blockquote-anchor\" target=\"_blank\">text.bythebay.io</a><div><br /><a href=\"https://chiefscientist.org/scala.bythebay.io\" data-href=\"scala.bythebay.io\" class=\"markup--anchor markup--blockquote-anchor\" target=\"_blank\">scala.bythebay.io</a><br /><a href=\"https://chiefscientist.org/bigdatascala.org\" data-href=\"bigdatascala.org\" class=\"markup--anchor markup--blockquote-anchor\" target=\"_blank\">bigdatascala.org</a></div></blockquote><blockquote id=\"5dfd\" class=\"graf graf--blockquote graf-after--blockquote\"><div>Both previous installments of SBTB sold out completely.</div></blockquote><blockquote id=\"aad9\" class=\"graf graf--blockquote graf-after--blockquote\"><div>You can find the talks from the previous conferences and meetups at Functional.TV. The 2014 conference is now at</div></blockquote><blockquote id=\"e1df\" class=\"graf graf--blockquote graf-after--blockquote\"><div>2014.scala.bythebay.io (photos from 2014 SBTB)</div></blockquote><blockquote id=\"3b38\" class=\"graf graf--blockquote graf-after--blockquote\"><div><strong class=\"markup--strong markup--blockquote-strong\">We’re also creating a new kind of an all-day tutorial — Complete Pipeline Training, where in one day we’ll go through an end-to-end datapipeline in Scala, running Akka APIs on Mesos and pumping data through Kafka into Spark. Each segment will be taught by the respective company driving the component — Mesosphere, Typesafe, Confluent, and Databricks</strong>.</div></blockquote><p id=\"98de\" class=\"graf graf--p graf-after--blockquote\">The acronym SMACK was used publicly in the official announcement of the training. Here it is in the context of collecting questions for the closing panel at Big Data Scala with Martin Odersky, creator of Scala and cofounder of Typesafe (now Lightbend), who keynoted it.</p><figure id=\"0a91\" class=\"graf graf--figure graf-after--p\"><div class=\"aspectRatioPlaceholder is-locked\"><img class=\"graf-image\" data-image-id=\"1*THEpX1HaETt6rw6w80-7Fg.png\" data-width=\"2632\" data-height=\"1678\" data-action=\"zoom\" data-action-value=\"1*THEpX1HaETt6rw6w80-7Fg.png\" src=\"https://cdn-images-1.medium.com/max/1600/1*THEpX1HaETt6rw6w80-7Fg.png\" alt=\"image\" /></div></figure><p id=\"4f8a\" class=\"graf graf--p graf-after--figure\">The C for Cassandra was added when we invited Ryan Knight and Evan Chan. Ryan transitioned from Typesafe to DataStax, and Evan combined Spark and Cassandra for fast OLAP.</p><p id=\"739c\" class=\"graf graf--p graf-after--p\">Here’s the final lineup as delivered on the Complete Pipeline Training day</p><p id=\"4b42\" class=\"graf graf--p graf-after--p\">— <strong class=\"markup--strong markup--p-strong\">S: Scala and Spark</strong> =&gt; Typesafe, Databricks; every trainer was a fairly well-known Scala developer. Chris Fregly represented Databricks and Advanced Spark. Nilanjan Raychaudhuri helped with the Akka presentation. For Spark, we used <a href=\"http://spark-notebook.io\" data-href=\"http://spark-notebook.io\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Spark Notebook</a> as the GUI, presented by its creator Andy Petrella.</p><p id=\"6e57\" class=\"graf graf--p graf-after--p\">— <strong class=\"markup--strong markup--p-strong\">M: Mesos</strong> =&gt; Mesosphere. Jason Swartz</p><p id=\"3fe6\" class=\"graf graf--p graf-after--p\">— <strong class=\"markup--strong markup--p-strong\">A: Akka</strong> =&gt; Typesafe, Duncan De Vore, Nilanjan with slides, Ryan Knight emeritus.</p><p id=\"91a9\" class=\"graf graf--p graf-after--p\">— <strong class=\"markup--strong markup--p-strong\">C: Cassandra</strong>: Ryan Knight, for a while of Typesafe and then of DataStax, helped across the stack. Evan Chan (of Spark Job Server and FiloDB fame) is recognized for marrying Spark and Cassandra and was also instrumental.</p><p id=\"f58b\" class=\"graf graf--p graf-after--p\">— <strong class=\"markup--strong markup--p-strong\">K: Kafka</strong> =&gt; Confluent. Jesse Anderson was fielded by Confluent as its official training provider. Ewen Cheslak-Postava helped with the Kafka segment in the docker.</p><p id=\"0fbb\" class=\"graf graf--p graf-after--p\">Here’s the github repo used in the training: <a href=\"https://github.com/bythebay/pipeline\" data-href=\"https://github.com/bythebay/pipeline\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">https://github.com/bythebay/pipeline</a>.</p><p id=\"3576\" class=\"graf graf--p graf-after--p\">It’s important to note that Helena Edelson wrote <a href=\"https://github.com/killrweather/killrweather\" data-href=\"https://github.com/killrweather/killrweather\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">killrweather</a>, a project implementing the SMACK Stack, earlier, and presented it at <a href=\"http://pnwscala.org/2014/index.html\" data-href=\"http://pnwscala.org/2014/index.html\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">PNWScala</a> 2014 (among other venues). When Ryan and Evan joined the training we considered using killrweather and would have loved to have Helena join us (but she deferred to Ryan). We ended up with a different codebase to simplify setup and allow for Spark Notebook as a Spark GUI. Helena is a pioneer — and now a lead innovator — of SMACK Stack.</p><p id=\"7ada\" class=\"graf graf--p graf-after--p\">Originally, we worked with Mesosphere to spin up a training cluster for every student. (Mesosphere was able to secure GCE credits, but it was not ready to run on GCE.) At that point, Mesosphere messaging was mostly on fully utilizing the datacenter. Immediately after Big Data Scala, <a href=\"https://mesosphere.com/blog/2015/08/20/mesosphere-infinity-youre-4-words-away-from-a-complete-big-data-system/\" data-href=\"https://mesosphere.com/blog/2015/08/20/mesosphere-infinity-youre-4-words-away-from-a-complete-big-data-system/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Mesosphere announced <strong class=\"markup--strong markup--p-strong\">dcos infinity</strong></a>, inspired by <a href=\"https://mesosphere.com/blog/2015/07/24/learn-everything-you-need-to-know-about-scala-and-big-data-in-oakland/\" data-href=\"https://mesosphere.com/blog/2015/07/24/learn-everything-you-need-to-know-about-scala-and-big-data-in-oakland/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">the SMACK training By the Bay</a>. Infinity spins up Kafka, Spark and Cassandra working together. The SMACK Stack training By the Bay was the catalyst that lead to <em class=\"markup--em markup--p-em\">dcos infinity</em> — I pitched it to Flo directly (my good friend Jason Swartz was a devmanager at Mesosphere and we discussed it over lunch on the deck), and Flo put us together with Matt Trifiro, the CMO, with whom we continue to collaborate. It is important to observe that the data pipeline offering encapsulated by <em class=\"markup--em markup--p-em\">dcos infinity</em> heralded a new direction for Mesosphere, from data center utilization to data pipeline integration as a product. They’ve not called it “<em class=\"markup--em markup--p-em\">dcos smack”</em> to allow for database vendor neutrality. (We’ve also discussed “<em class=\"markup--em markup--p-em\">dcos khrabrov</em>” as an easily googlable alias.:)</p><p id=\"62ce\" class=\"graf graf--p graf-after--p\">The training was an incredible success — we had a 100 people at Galvanize going over the whole stack in one day, using a fully dockerized setup we provided on USB. It took five sweaty guys in an AirBnB — that Andy Petrella rented — to finalize the night before, after which I took it home to replicate on a device running under Windows. Of course it failed, and I manually copied the USBs into the night. But thanks to Nitro docker genius Ben Rizkowski, it worked great. Ben even popped in a Slack support channel, on a Sunday, while house-hunting in the East Bay.</p><p id=\"f0ba\" class=\"graf graf--p graf-after--p\"><a href=\"http://2015.bigdatascala.bythebay.io\" data-href=\"http://2015.bigdatascala.bythebay.io\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Big Data Scala</a> was held for the first time together with the training. It was keynoted by Martin Odersky, the creator of Scala, Matei Zaharia, the creator of Spark, Jay Kreps, the creator of Kafka, and Mike Olson, the CSO of Cloudera. Here we had most of the creators of the SMACK stack in person, as well as its key proponents and integrators. We’ve unveiled <a href=\"http://noetl.org\" data-href=\"http://noetl.org\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">NoETL.org</a> there as a way to popularize the reactive, streaming approach to data, as opposed to batching and dumping/reparsing text from HDFS. NoETL is in fact another way to describe what SMACK is good for, as a new way to write data pipelines.</p><p id=\"b487\" class=\"graf graf--p graf-after--p\">Since all of original SMACK Stack trainers are public speakers and OSS leads, the notion spread fast. Notably, Evan Chan moved forward with <a href=\"https://github.com/tuplejump/FiloDB\" data-href=\"https://github.com/tuplejump/FiloDB\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">FiloDB</a>, combining Cassandra and Spark to support OLAP. Evan presented his work at SF Scala and SF Spark, as well as Scala By the Bay and Big Data Scala, and subsequently teamed up with Helena Edelson to advance FiloDB and SMACK Stack in industry. Evan ran a Q&amp;A with O’Reilly in the Fall 2015. At the same time we took SMACK Stack to Europe via the Nitro office, the home of the Dublin Spark meetup. We also regularly host Andy Petrella at there regularly who further spread the word. Dean Wampler, the Lightbend Big Data architect, will present SMACK Stack at the O’Reilly Architecture conference this Fall (2016) — see how <a href=\"https://twitter.com/deanwampler/status/752510307562586112\" data-href=\"https://twitter.com/deanwampler/status/752510307562586112\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">the SMACKing already began</a>!</p><p id=\"b52d\" class=\"graf graf--p graf-after--p\">The SMACK Stack concept had become such a hit that I and other Nitro practitioners were approached by publishers to put together a book describing it. I’m helping drive such a project, and we’re looking for co-authors — ping me if you’re interested.</p><p id=\"747f\" class=\"graf graf--p graf-after--p\">It’s a good time to remind all SMACK lovers that Scala By the Bay and Big Data Scala are held at Twitter this year, employing its own SMACK Stack that you can see every day in action — e.g. when you like a tweet and someone gets a notification immediately, for millions of tweets. We’re calling the whole conference Scale+Scala By the Bay, or simply <a href=\"http://scala.bythebay.io\" data-href=\"http://scala.bythebay.io\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Scalæ By the Bay</a>, and run three tracks over three days, all joined in harmony. The tracks are as follows:</p><p id=\"518f\" class=\"graf graf--p graf-after--p\">— Thoughtful Sofware Engineering with Types</p><p id=\"2ce3\" class=\"graf graf--p graf-after--p\">— Reactive Systems and Streaming</p><p id=\"39b3\" class=\"graf graf--p graf-after--p\">— Data Pipelines for Data Engineering and Machine Learning. This is SMACK Stack in action.</p><p id=\"0f17\" class=\"graf graf--p graf-after--p graf--trailing\">SMACK is a registered trademark of By the Bay, LLC (pending). It was first used in our SMACK training commercially, and nowhere else before it. We trained a hundred people to build a whole big data backend in a day, and they took this knowledge to the world. It’s important this history, however brief, is acknowledged when using the term SMACK stack.</p>"}}]}},"pageContext":{"alternative_id":11768}}