{"data":{"allAnantCassandralinks":{"edges":[{"node":{"title":"DataStax OpsCenter","alternative_id":4889,"content":"<div class=\"DX3_SbBnr_DarkBlueBar\" readability=\"13\">\n    <div class=\"thismb2content1width1\" readability=\"23\"><p>&#13;\n&#13;\nDataStax OpsCenter is the web-based visual management and monitoring <br/>&#13;\nsolution for <a href=\"https://www.datastax.com/products/datastax-enterprise\" class=\"DX3_skyblue_link\" target=\"_self\">&#13;\nDataStax Enterprise (DSE)</a>. OpsCenter has integrated functionality <br/>&#13;\nfor real-time monitoring, tuning, provisioning, backup, and security <br/>&#13;\nmanagement. OpsCenter provides everything you need to intelligently <br/>&#13;\nmanage and monitor your business-critical systems at epic scale. &#13;\n    </p></div>\n</div><div class=\"thismb2content1width1 center  dx_actmrgn_bttm_e39px\" readability=\"64\">\n    <p>&#13;\nDSE OpsCenter&#13;\n    </p>\n    <p>&#13;\nBuilt for Cloud Applications&#13;\n    </p>\n    <p>&#13;\nDataStax OpsCenter is built from the ground up to manage and monitor the database infrastructure that powers large-scale <a href=\"https://www.datastax.com/cloud-applications\" target=\"_self\">cloud applications</a>. With the click of a button, you can provision, monitor, backup, and manage your DSE clusters with little to no expertise. OpsCenter can manage clusters that exist on-premise, in the cloud, or in hybrid environments spanning multiple data centers. OpsCenter not only helps reduce your operational and hardware costs but dramatically increases your overall operational productivity. &#13;\n    </p>\n    <p>&#13;\nIntelligent Cluster Management&#13;\n    </p>\n    <p>&#13;\nDataStax OpsCenter supplies a centralized dashboard to monitor clusters, which allows you to quickly identify which clusters require your attention. OpsCenter monitors key metrics and performs trend analysis to proactively identify and alert on issues before they impact production workloads. OpsCenter also seamlessly integrates with existing management tools and workflows such as <a href=\"http://graphite.wikidot.com/\" target=\"_blank\">Graphite</a> and SNMP management consoles. <a href=\"https://www.datastax.com/wp-content/themes/datastax-2014-08/images/products/OpsCenter-Screenshot-IntelligentClusterManagement.jpg\" class=\"fancybox image\" alt=\"Screenshot\">View screenshot.</a>&#13;\n    </p>\n<p>&#13;\nPoint-and-Click Provisioning&#13;\n    </p>\n    <p>&#13;\nThe provisioning functionality of the OpsCenter Lifecycle Manager provides declarative configuration management for your cluster. You can easily create new clusters, add or remove capacity in place without downtime, and change configuration files all from a central location. All of this functionality is also exposed via a RESTful API and integrates easily with your existing tools and workflows. <a href=\"https://www.datastax.com/wp-content/themes/datastax-2014-08/images/products/OpsCenter-Screenshot-PointandClickProvisioning.jpg\" class=\"fancybox image\" alt=\"Screenshot\">View screenshot.</a>&#13;\n    </p>\n</div><div class=\"thismb2content1width1  center  dx_actmrgn_bttm_e39px  \" readability=\"44\">\n    <p>&#13;\nVisual Monitoring and Tuning&#13;\n    </p>\n    <p>&#13;\nOpsCenter offers customized dashboards to provide detailed information and trend analysis for real-time and historical system metrics. Operations staff can easily spot outliers, discover bottlenecks, and identify machines that may be impacting system performance.&#13;\n<a href=\"https://www.datastax.com/wp-content/themes/datastax-2014-08/images/products/OpsCenter-Screenshot-VisualMonitoringandTuning.jpg\" class=\"fancybox image\" alt=\"Screenshot\">View screenshot.</a>&#13;\n    </p>\n    <p>&#13;\nRobust Backup and Point-in-Time Recovery&#13;\n    </p>\n    <div class=\"dxfnts_ds_f18l23  dx_actmrgn_bttm_et48px  dx_maxwidthsetup_center\" readability=\"25\">\nDataStax delivers full backup and disaster recovery protection for database clusters through the Backup Service. The Backup Service has a suite of features designed to help manage backup and restore procedures for large clusters of machines distributed across multiple data centers. \n<p>This includes the ability to visually schedule, backup and restore, hundreds of nodes at a point in time or object level, determine when a full or partial backup is needed through smart algorithms, and automatically transfer backups to on-premise or cloud storage with built-in compression and retention policies. &#13;\n</p><p>Additionally, the Backup Service includes notification and visual monitoring of backup and restore tasks, as well as the ability to clone database clusters (i.e. copying one cluster to another).&#13;\n    </p></div>\n    <p>&#13;\nManagement Success&#13;\n    </p>\n    <p>&#13;\nThe Automatic Management Services of DSE are designed to increase your productivity by automating important maintenance and monitoring procedures. DSE Management Services are capable of identifying configuration parameters that violate best practices, performing automated cluster consistency checks and forecasting a need for additional cluster capacity.&#13;\n    </p>\n</div><div class=\"thismb2content1width1 center  dx_actmrgn_bttm_e39px  \" readability=\"41\">\n    <p>&#13;\nAlways-On Management and Monitoring&#13;\n    </p>\n    <p>&#13;\nAutomatic failover is built into OpsCenter, which helps ensure that any scheduled tasks or monitoring activities continue even if the primary OpsCenter server fails.&#13;\n    </p>\n    <p>&#13;\nAccess &amp; Authorization&#13;\n    </p>\n    <p>&#13;\nDataStax OpsCenter is a secure management and monitoring tool that has granular roles and permissions to control the tasks that administrators and operations staff can perform.&#13;\n    </p>\n    <p>&#13;\nPowerful APIs for Seamless Integration&#13;\n    </p>\n    <p>&#13;\nEvery feature and component of OpsCenter is exposed via a comprehensive set of RESTful APIs. You can easily provision, monitor, and execute maintenance tasks from your favorite scripting language. The OpsCenter APIs make it easy to integrate powerful functionality into your existing tools and workflows.&#13;\n    </p>\n</div>"}}]}},"pageContext":{"alternative_id":4889}}