{"data":{"allAnantCassandralinks":{"edges":[{"node":{"title":"justinbreese/dse-cassandra-stress","alternative_id":12722,"content":"<article class=\"markdown-body entry-content\" itemprop=\"text\">\n<ul><li>I wanted to run some <code>cassandra-stress</code> testing on the three main cloud providers (Google, Amazon, and Microsoft) on similarly sized DataStax Enterprise clusters and see what the results would be</li>\n<li>Why did I want to do this? When running on a cluster of similarly-sized VMs, networking starts to come into play for replication, storage, and stronger consistency levels. This type of an exercise exposes the network so you can understand what you may have to contend with for a specific cloud provider versus another</li>\n<li>This is also a tutorial on some of the fun switches that you can use to tune your <code>cassandra-stress</code> test</li>\n<li>This is not a tutorial on how to deploy the VMs, if you want that information, please go over to another repo of mine as I repurposed it. It is 99% similar; I just didn't enable SSL and installed <code>dse-full</code>: <a href=\"https://github.com/justinbreese/dse-multi-cloud-demo\">https://github.com/justinbreese/dse-multi-cloud-demo</a></li>\n</ul><h2><a id=\"user-content-methodology\" class=\"anchor\" aria-hidden=\"true\" href=\"#methodology\"></a>Methodology</h2>\n<ul><li>Setup 4 VMs on each of the cloud providers; VM size was as close as possible with similar storage provisioned: i3.4xl, Standard_DS14_v2, and n1-highmem-16</li>\n<li>3 of the VMs will be running DataStax Enterprise as their own cluster; again each cloud is their own cluster</li>\n<li>The 4th VM runs DataStax OpsCenter and acts as a <code>cassandra-stress</code> client\n<a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/justinbreese/dse-cassandra-stress/blob/master/architecture.png?raw=true\"><img src=\"https://github.com/justinbreese/dse-cassandra-stress/raw/master/architecture.png?raw=true\" alt=\"Screenshot\" /></a></li>\n<li>Next, I ran this test on each of the clients 35 times: <code>cassandra-stress user profile=stress.yaml n=1000000 ops\\(insert=3,likelyquery1=1\\) cl=QUORUM -mode native cql3 user=cassandra password=datastax -node 104.196.140.126 -rate threads\\&gt;=121</code>\n<ul><li>I then captured the results into an Excel file</li>\n</ul></li>\n<li>Then I decided to really turn it up and do 1B operations; and it led to this test that was run once on each of the clients: <code>nohup cassandra-stress user profile=stress.yaml n=1000000000 ops\\(insert=3,likelyquery1=1\\) cl=QUORUM -mode native cql3 user=cassandra password=datastax -node 40.118.149.27 -rate threads=300 -log file=output.txt -errors ignore</code>\n<ul><li>Again, I captured the results in an Excel file</li>\n</ul></li>\n</ul><h2><a id=\"user-content-breakdown-the-switches\" class=\"anchor\" aria-hidden=\"true\" href=\"#breakdown-the-switches\"></a>Breakdown the switches!</h2>\n<p>I told you that this would be educational!</p>\n<h3><a id=\"user-content-first-test\" class=\"anchor\" aria-hidden=\"true\" href=\"#first-test\"></a>First test</h3>\n<p><code>cassandra-stress user profile=stress.yaml n=1000000 ops\\(insert=3,likelyquery1=1\\) cl=QUORUM -mode native cql3 user=cassandra password=datastax -node 104.196.140.126 -rate threads\\&gt;=121</code></p>\n<ul><li><code>profile=stress.yaml</code> --&gt; take a look at the one that I created in the root of this repo. I went to a colleague's website and was able to build it in a few minutes (source below). Do this to create the actual data model that you want to use in production!</li>\n<li><code>n=1000000</code> --&gt; the amount of times that you want to run operations</li>\n<li><code>ops\\(insert=3,likelyquery1=1\\)</code> --&gt; the ratio of writes:reads that you want done for your test. This is a 3:1 ratio. You can be specific about the reads that you want done. In <code>stress.yaml</code>, towards the bottom, there is a query called <code>likelyquery</code> that I want to run for my reads. You can customize this to read whatever query you prefer; super useful!</li>\n<li><code>cl=QUORUM</code> --&gt; consistency level. I see way too many stress tests done just at a consistency level of <code>CL=ONE</code>. The reality is that most don't run with a <code>CL=ONE</code> when they're in production; so why would they test against it now. Run your test against the consistency level that you want to run in production!</li>\n<li><code>-mode native cql3 user=cassandra password=datastax</code> --&gt; you need the client to be able to access DataStax Enterprise, so ensure it has the correct username and password to do so</li>\n<li><code>-node 104.196.140.126</code> --&gt; as I am running on a client, I need to be able to connect to the cluster. This IP address was of one of the seed nodes for the cluster that I was targeting. Once I point it towards one node, the client will become aware of all of the other nodes via gossip.</li>\n<li><code>-rate threads\\&gt;=121</code> --&gt; this runs the test at thread levels that are greater than or equal to 121. You can run at less than that, but I wanted to run at realistic levels.\n<ul><li>A great first test is to run at <code>-rate auto</code> which will will start at a single digit thread count and work its way up as high as it can go. This is great for understanding what is going on so you can understand the relationship for latency, operations/second, threadcount, etc.</li>\n</ul></li>\n</ul><h2><a id=\"user-content-second-test\" class=\"anchor\" aria-hidden=\"true\" href=\"#second-test\"></a>Second test</h2>\n<p>I am not going to go over the flags/arguments that I went over in the previous example. Instead, I'll go over the new ones or changes.</p>\n<p><code>nohup cassandra-stress user profile=stress.yaml n=1000000000 ops\\(insert=3,likelyquery1=1\\) cl=QUORUM -mode native cql3 user=cassandra password=datastax -node 40.118.149.27 -rate threads=300 -log file=output.txt -errors ignore</code></p>\n<ul><li><code>nohup</code> --&gt; I nohup'd because I wanted this to run as its own process. The advantage here is that it will run after I exit the session, computer goes to sleep, etc.</li>\n<li><code>n=1000000000</code> --&gt; increased the ops to 1B</li>\n<li><code>-rate threads=300</code> --&gt; set the thread count to an even 300. This is generally a point at which we start to see saturation, contention, etc.; so I wanted to stay in that range for an extended period of time</li>\n<li><code>-log file=output.txt</code> --&gt; as this would be a long running test, I wanted to be able to save the output all into a file that way I could <code>SCP</code> it back to my laptop for analysis in Excel. Otherwise it will just print to the screen; and after 1B transactions, that gets messy!</li>\n<li><code>-errors ignore</code> --&gt; after you run 1B transactions, you will get errors eventually. Cassandra handles them just fine, but you don't want it to stop the test. Do this for your tests! Otherwise, you could have your test stop half-way through; ask me how I know...</li>\n</ul><h2><a id=\"user-content-results\" class=\"anchor\" aria-hidden=\"true\" href=\"#results\"></a>Results</h2>\n<p>to be continued... maybe, if I can.</p>\n<ul><li>If you want to learn more about <code>cassandra-stress</code>, then look no further than the excellent work of my colleague: <a href=\"https://www.datastax.com/dev/blog/data-modeler\" rel=\"nofollow\">https://www.datastax.com/dev/blog/data-modeler</a></li>\n<li>The actual tool that builds out the <code>stress.yaml</code>: <a href=\"https://www.sestevez.com/sestevez/CassandraDataModeler/\" rel=\"nofollow\">https://www.sestevez.com/sestevez/CassandraDataModeler/</a></li>\n</ul>\n<p>Thanks for taking a look at this repo and let me know if you have any questions.</p>\n</article>"}}]}},"pageContext":{"alternative_id":12722}}