{"data":{"allAnantCassandralinks":{"edges":[{"node":{"title":"phact/SimpleSparkStreaming","alternative_id":12729,"content":"<p>This is a guide for how to use the Streaming Analytics Proofshop asset brought to you by the Vanguard team. The Proofshop consists of demonstrating real time data processing and analytics with the DSE paltform at high throughput, low latency, and scale.</p><h3>Motivation</h3><p>DSE is often seen as a serving layer for the output of analytical applications on large datasets. Often the analytics themselves are performed in slow batch data layers and persisted to DSE only when they are ready to be exposed to a front end or downstream system. In many cases, as we look to satisfy end user requirements, it makes more sense to perform some of these operational analytics in real time using DSE's streaming analytics capabilities.</p><h3>What is included?</h3><p>This field asset includes sample usage of DSE Streaming Analytics in the following contexts:</p><ul><li>Data generation using EBDSE served via TCP</li>\n<li>Spark streaming application that persists raw events into DSE and rollups into summary tables</li>\n<li>Tuning capabilities for throughput and latencies</li>\n<li>Checkpointing into DSEFS</li>\n</ul><h3>Business Take Aways</h3><p>In the right now economy businesses need analytics that are up to date. Monthly, weekly, and hourly reports are often too old to be actionable. DSE Streaming analytics allows businesses to operationalize structured analytics to obtain real time insights to power their decision making.</p><p>Out of the Five Dimensions, this asset focuses on Relevancy and Responsiveness without ignoring the remaining dimensions (Availability, Accessibility, Engagement).</p><p>If discussing this asset with a business stakeholder it may be relevant to walk them through <a href=\"https://docs.google.com/presentation/d/1z_wGENm2RNX1oqwUkSzDg3P03xPG2P9lKEjj8UiZOQM/edit?usp=sharing\" rel=\"nofollow\">The DataStax Story</a></p><h3>Technical Take Aways</h3><p>DSE Streaming Analytics is DataStax's version of Apache Spark (TM) which ships with DSE and is modified to match the design principles that our engineering team has always focused on when building C* and DSE (CARDS). DSE Spark is optimized for high availability and operational simplicity by removing its dependency on zookeeper and using LWTs for leader elections. Furthermore, DSE Spark is optimized for performance against the DSE backend with features that include Contiunous Paging and Direct Joins.</p><p>Building Streaming Analytics applications on DSE requires:</p><ul><li>Having a streaming source - in this case we use EBDSE's tcpserver functionality and data generation capabilities as our streaming source</li>\n<li>A Spark Streaming Application - sources for the app included as part of the asset</li>\n</ul><p>For more general information on how to use Spark Streaming check out the <a href=\"https://spark.apache.org/docs/latest/streaming-programming-guide.html\" rel=\"nofollow\">Programming Guide</a> in the Spark Docs.</p><p>These docs will dive deeper on the following functionality:</p><ul><li>Cumulative Streaming Calculations</li>\n<li>Monitoring and Tuning Streaming Jobs</li>\n</ul>"}}]}},"pageContext":{"alternative_id":12729}}